<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia at May 4, 2011 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Sody's Site - Site creating using maven</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="sody" />
    <meta name="Date-Creation-yyyymmdd" content="20110315" />
    <meta name="Date-Revision-yyyymmdd" content="20110504" />
    <meta http-equiv="Content-Language" content="en" />
        

          <!-- Google Analytics -->
    <script type="text/javascript">
    
      var _gaq = _gaq || [];
      _gaq.push(['_setAccount', 'UA-23122478-1']);
      _gaq.push(['_trackPageview']);

      (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
      })();

    </script>
    </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                Sody's Site
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
                
                <div class="xleft">
        <span id="publishDate">Last Published: 2011-05-04</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="index.html" title="English">English</a>
            |
                        <a href="ru/index.html" title="Русский">Русский</a>
              
                
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
                
                                <h5>Articles</h5>
                  <ul>
                  <li class="none">
            <strong>Site creation using maven</strong>
          </li>
                  <li class="none">
                          <a href="spi.html" title="SPI mechanism usage">SPI mechanism usage</a>
            </li>
          </ul>
                       <h5>Translates</h5>
                  <ul>
                  <li class="none">
                          <a href="ioc.html" title="Inversion of Control">Inversion of Control</a>
            </li>
                  <li class="none">
                          <a href="injection.html" title="Dependency Injection pattern">Dependency Injection pattern</a>
            </li>
                  <li class="none">
                          <a href="performance.html" title="Speeding Up Your Web Site">Speeding Up Your Web Site</a>
            </li>
          </ul>
                       <h5>Projects</h5>
                  <ul>
                  <li class="none">
                          <a href="greatage/index.html" title="Great Age">Great Age</a>
            </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section"><h2>Site creating using maven<a name="Site_creating_using_maven"></a></h2><p>&#x423;&#x436;&#x435; &#x434;&#x43e;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x43e;&#x43b;&#x433;&#x43e;&#x435; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e; <a class="externalLink" href="http://maven.apache.org/">&#x43c;&#x430;&#x432;&#x435;&#x43d;</a> &#x43a;&#x430;&#x43a; &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x434;&#x43b;&#x44f; &#x441;&#x431;&#x43e;&#x440;&#x43a;&#x438; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x43e;&#x432;. &#x418;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x44d;&#x442;&#x43e;&#x442; &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43d;&#x44b;&#x439; &#x438; &#x43c;&#x43e;&#x434;&#x43d;&#x44b;&#x439;. &#x41e;&#x43d; &#x43e;&#x441;&#x43e;&#x431;&#x435;&#x43d;&#x43d;&#x43e; &#x43f;&#x43e;&#x43f;&#x443;&#x43b;&#x44f;&#x440;&#x435;&#x43d; &#x441;&#x440;&#x435;&#x434;&#x438; java &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x447;&#x438;&#x43a;&#x43e;&#x432; &#x445;&#x43e;&#x442;&#x44f; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x435;&#x43d; &#x438; &#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x43e;&#x431;&#x43b;&#x430;&#x441;&#x442;&#x44f;&#x445;. &#x422;&#x430;&#x43a; &#x432;&#x43e;&#x442;, &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x44f; &#x445;&#x43e;&#x442;&#x435;&#x43b; &#x431;&#x44b; &#x440;&#x430;&#x441;&#x441;&#x43a;&#x430;&#x437;&#x430;&#x442;&#x44c; &#x43e; &#x442;&#x43e;&#x43c; &#x43a;&#x430;&#x43a; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441; &#x435;&#x433;&#x43e; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x442;&#x44c; &#x441;&#x430;&#x439;&#x442;. &#x41d;&#x435; &#x437;&#x43d;&#x430;&#x44e; &#x434;&#x43b;&#x44f; &#x447;&#x435;&#x433;&#x43e; &#x44d;&#x442;&#x43e; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x440;&#x438;&#x433;&#x43e;&#x434;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x432;&#x430;&#x43c;, &#x44f; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x441;&#x44c; &#x44d;&#x442;&#x438;&#x43c; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43a; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430;&#x43c;. &#x412; &#x44d;&#x442;&#x43e;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x435; &#x44f; &#x43f;&#x43e;&#x43f;&#x44b;&#x442;&#x430;&#x44e;&#x441;&#x44c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x442;&#x44c; html &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x443; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x443;&#x44e; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x438;&#x437; &#x44d;&#x442;&#x43e;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x438; &#x438; &#x432;&#x44b;&#x433;&#x43b;&#x44f;&#x434;&#x435;&#x449;&#x435;&#x439; &#x43a;&#x430;&#x43a; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x430;&#x44f; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x44f; &#x43d;&#x430; &#x445;&#x430;&#x431;&#x440;&#x435;.</p><img src="images/sample-site1.png" alt="&#x427;&#x442;&#x43e; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x438;&#x442;&#x44c;&#x441;&#x44f;" /><p>&#x421;&#x430;&#x439;&#x442; &#x434;&#x43b;&#x44f; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x44b;:</p><div class="source"><pre>mvn site
</pre></div><p>&#x41f;&#x43e; &#x443;&#x43c;&#x43e;&#x43b;&#x447;&#x430;&#x43d;&#x438;&#x44e; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x435; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x44d;&#x442;&#x43e;&#x439; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x44b; &#x434;&#x43b;&#x44f; &#x43f;&#x443;&#x441;&#x442;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441;&#x442;&#x430;&#x43d;&#x434;&#x430;&#x440;&#x442;&#x43d;&#x44b;&#x439; &#x43d;&#x430;&#x431;&#x43e;&#x440; html &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;: index.html, dependencies.html, integration.html... &#x42d;&#x442;&#x43e; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x44b; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43f;&#x43b;&#x430;&#x433;&#x438;&#x43d;&#x43e;&#x43c; <a class="externalLink" href="http://maven.apache.org/plugins/maven-project-info-reports-plugin/">maven-project-info-reports-plugin</a>. &#x418;&#x445; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43e;&#x442;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x44c; &#x43b;&#x438;&#x431;&#x43e; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x438;&#x432; <i>reporting</i> &#x441;&#x435;&#x43a;&#x446;&#x438;&#x44e; &#x432; pom.xml. &#x41d;&#x43e; &#x43d;&#x435; &#x431;&#x443;&#x434;&#x443; &#x443;&#x433;&#x43b;&#x443;&#x431;&#x43b;&#x44f;&#x442;&#x44c;&#x441;&#x44f; &#x432; &#x44d;&#x442;&#x443; &#x442;&#x435;&#x43c;&#x443;, &#x442;&#x430;&#x43a; &#x43a;&#x430;&#x43a; &#x445;&#x43e;&#x447;&#x443; &#x440;&#x430;&#x441;&#x441;&#x43a;&#x430;&#x437;&#x430;&#x442;&#x44c; &#x43f;&#x440;&#x43e; &#x434;&#x440;&#x443;&#x433;&#x443;&#x44e; &#x43e;&#x441;&#x43e;&#x431;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430; - &#x434;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x441;&#x432;&#x43e;&#x435;&#x433;&#x43e; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430; &#x438; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x435;&#x433;&#x43e; &#x432;&#x438;&#x434;&#x430; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43c;&#x43e;&#x433;&#x43e; &#x441;&#x430;&#x439;&#x442;&#x430;.</p></div><div class="section"><h2>&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430;<a name="a_"></a></h2><p>&#x418;&#x442;&#x430;&#x43a;, &#x434;&#x43b;&#x44f; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x434;&#x438;&#x43c; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;. &#x414;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; <a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/">maven-site-plugin</a>, &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x435;&#x441;&#x442;&#x44c; &#x441;&#x43c;&#x44b;&#x441;&#x43b; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x432; <i>build</i> &#x441;&#x435;&#x43a;&#x446;&#x438;&#x44e; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430; &#x438; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x438;&#x442;&#x44c; &#x43f;&#x43e;&#x434; &#x441;&#x432;&#x43e;&#x438; &#x43d;&#x443;&#x436;&#x434;&#x44b;.</p><div class="source"><pre>&lt;project xmlns=&quot;http://maven.apache.org/POM/4.0.0&quot;
   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
   xsi:schemaLocation=&quot;http://maven.apache.org/POM/4.0.0
   http://maven.apache.org/maven-v4_0_0.xsd&quot;&gt;
  &lt;modelVersion&gt;4.0.0&lt;/modelVersion&gt;

  &lt;groupId&gt;com.example&lt;/groupId&gt;
  &lt;artifactId&gt;site-example&lt;/artifactId&gt;
  &lt;version&gt;1.0-SNAPSHOT&lt;/version&gt;
  &lt;packaging&gt;pom&lt;/packaging&gt;

  &lt;name&gt;Site Example&lt;/name&gt;
  &lt;description&gt;
    This is an example application that demonstrates creation of site for project using maven
  &lt;/description&gt;

  &lt;build&gt;
    &lt;plugins&gt;
      &lt;plugin&gt;
        &lt;groupId&gt;org.apache.maven.plugins&lt;/groupId&gt;
        &lt;artifactId&gt;maven-site-plugin&lt;/artifactId&gt;
        &lt;version&gt;2.1&lt;/version&gt;
        &lt;configuration&gt;
          &lt;inputEncoding&gt;UTF-8&lt;/inputEncoding&gt;
          &lt;outputEncoding&gt;UTF-8&lt;/outputEncoding&gt;
          &lt;generateReports&gt;false&lt;/generateReports&gt;
        &lt;/configuration&gt;
      &lt;/plugin&gt;
    &lt;/plugins&gt;
  &lt;/build&gt;
&lt;/project&gt;
</pre></div><p>&#x412; &#x44d;&#x442;&#x43e;&#x43c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x435; &#x44f;&#x432;&#x43d;&#x43e; &#x437;&#x430;&#x434;&#x430;&#x43d;&#x44b; &#x43a;&#x43e;&#x434;&#x438;&#x440;&#x43e;&#x432;&#x43a;&#x438; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x430;(<i>inputEncoding</i>) &#x438; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x435;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b;(<i>outputEncoding</i>), &#x430; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43e;&#x442;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x430; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44f; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x43e;&#x432;(<i>generateReports</i>). &#x41f;&#x43e;&#x43b;&#x43d;&#x44b;&#x439; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43a; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x435;&#x442;&#x44c; <a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/site-mojo.html">&#x437;&#x434;&#x435;&#x441;&#x44c;</a>. &#x422;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x435;&#x440;&#x435;&#x445;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x43a; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;.</p></div><div class="section"><h2>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430;<a name="a_"></a></h2><p>&#x41f;&#x43e; &#x443;&#x43c;&#x43e;&#x43b;&#x447;&#x430;&#x43d;&#x438;&#x44e; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x44b; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x430;&#x439;&#x442;&#x430; &#x445;&#x440;&#x430;&#x43d;&#x44f;&#x442;&#x441;&#x44f; &#x432; src/site &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44b;&#x435; &#x43f;&#x43e; &#x43f;&#x430;&#x43f;&#x43a;&#x430;&#x43c; &#x441; &#x441;&#x43e;&#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x441; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;, &#x43a;&#x43e;&#x438;&#x445; &#x432; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x435; &#x446;&#x435;&#x43b;&#x44b;&#x445; 3 &#x448;&#x442;&#x443;&#x43a;&#x438;:</p><ul><li><a class="externalLink" href="http://maven.apache.org/doxia/references/apt-format.html">APT Format</a> (&quot;Almost Plain Text&quot;). &#x424;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x447;&#x435;&#x43c;-&#x442;&#x43e; &#x43d;&#x430;&#x43f;&#x43e;&#x43c;&#x438;&#x43d;&#x430;&#x44e;&#x449;&#x438;&#x439; &#x432;&#x441;&#x435;&#x43c; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x439; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x432;&#x438;&#x43a;&#x438;. &#x41d;&#x430;&#x439;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x441;&#x438;&#x43c;&#x43f;&#x430;&#x442;&#x438;&#x447;&#x43d;&#x44b;&#x439; &#x43c;&#x43d;&#x435;, &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x434;&#x430;&#x43b;&#x435;&#x435; &#x432; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x435; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x432;&#x43d;&#x438;&#x43c;&#x430;&#x43d;&#x438;&#x44f; &#x437;&#x430;&#x43e;&#x441;&#x442;&#x440;&#x44e; &#x438;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x43d;&#x430; &#x43d;&#x435;&#x43c;.</li><li><a class="externalLink" href="http://maven.apache.org/doxia/references/fml-format.html">FML Format</a> (&quot;FAQ Markup Language&quot;). &#x41a;&#x430;&#x43a; &#x44f;&#x441;&#x43d;&#x43e; &#x438;&#x437; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; FAQ &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x438;. &#x41f;&#x440;&#x438;&#x448;&#x435;&#x43b; &#x438;&#x437; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;.</li><li><a class="externalLink" href="http://maven.apache.org/doxia/references/xdoc-format.html">XDoc format</a>. &#x41f;&#x440;&#x438;&#x448;&#x435;&#x43b; &#x438;&#x437; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;, &#x433;&#x434;&#x435; &#x431;&#x44b;&#x43b; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x43c;/&#x435;&#x434;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;.</li></ul><p>&#x412; &#x446;&#x435;&#x43b;&#x43e;&#x43c;, &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x430;&#x44f; &#x441;&#x442;&#x440;&#x443;&#x43a;&#x442;&#x443;&#x440;&#x430; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x430; &#x432;&#x44b;&#x433;&#x43b;&#x44f;&#x434;&#x435;&#x442;&#x44c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x43d;&#x43e; &#x442;&#x430;&#x43a;:</p><div class="source"><pre>+- src/
   +- site/
      +- resources/
      |  +- css/
      |  |  +- site.css
      |  |
      |  +- images/
      |     +- pic1.jpg
      |
      +- apt/
      |  +- index.apt
      |
      +- fml/
      |  +- general.fml
      |  +- faq.fml
      |
      +- xdoc/
      |  +- other.xml
      |
      +- site.xml
</pre></div><p>&#x420;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44b;&#x433;&#x43b;&#x44f;&#x434;&#x435;&#x442;&#x44c; &#x442;&#x430;&#x43a;:</p><div class="source"><pre>+- target/
   +- site/
      +- css/
      |
      +- images/
      |
      +- index.html
      +- general.html
      +- faq.html
      +- other.html
</pre></div><p>&#x41a;&#x430;&#x43a; &#x432;&#x438;&#x434;&#x43d;&#x43e;, &#x43a;&#x440;&#x43e;&#x43c;&#x435; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432; &#x437;&#x434;&#x435;&#x441;&#x44c; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x440;&#x438;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x444;&#x430;&#x439;&#x43b; <i>site.xml</i> - &#x434;&#x435;&#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x440; &#x441;&#x430;&#x439;&#x442;&#x430; &#x438; &#x43f;&#x430;&#x43f;&#x43a;&#x430; <i>resource</i> - &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x435; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44b; &#x441;&#x430;&#x439;&#x442;&#x430;, &#x43e; &#x432;&#x441;&#x435;&#x43c; &#x44d;&#x442;&#x43e;&#x43c; &#x43f;&#x43e;&#x437;&#x434;&#x43d;&#x435;&#x435;, &#x430; &#x43f;&#x43e;&#x43a;&#x430; &#x432;&#x435;&#x440;&#x43d;&#x435;&#x43c;&#x441;&#x44f; &#x43a; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44e; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430;.</p><div class="section"><h3>&#x424;&#x43e;&#x440;&#x43c;&#x430;&#x442; APT<a name="a_APT"></a></h3><p>&#x41e;&#x43f;&#x438;&#x441;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x441;&#x442;&#x440;&#x443;&#x43a;&#x442;&#x443;&#x440;&#x443; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44f; &#x434;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x44b;&#x435; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x44b;&#x435; &#x43a;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43a;&#x446;&#x438;&#x438;, &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x441;&#x438;&#x43b;&#x44c;&#x43d;&#x43e; &#x43d;&#x430;&#x43f;&#x43e;&#x43c;&#x438;&#x43d;&#x430;&#x435;&#x442; &#x441;&#x442;&#x438;&#x43b;&#x44c; &#x432;&#x438;&#x43a;&#x438;. &#x41f;&#x440;&#x438; &#x44d;&#x442;&#x43e;&#x43c; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x432;&#x44b;&#x433;&#x43b;&#x44f;&#x434;&#x438;&#x442; &#x43a;&#x430;&#x43a; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x44b;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x44b;&#x439; &#x444;&#x430;&#x439;&#x43b;. &#x427;&#x442;&#x43e;&#x431;&#x44b; &#x43f;&#x43e;&#x43a;&#x430;&#x437;&#x430;&#x442;&#x44c; &#x43a;&#x430;&#x43a; &#x43e;&#x43d; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x440;&#x430;&#x441;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x43c; &#x43e;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x438;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x438; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x430;.</p><p>&#x414;&#x43b;&#x44f; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x43c; &#x437;&#x430;&#x433;&#x43e;&#x43b;&#x43e;&#x432;&#x43e;&#x43a;. &#x42d;&#x442;&#x43e; &#x43e;&#x43f;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;, &#x435;&#x441;&#x43b;&#x438; &#x43f;&#x440;&#x438;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x43d;&#x430;&#x445;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x432; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x435; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;. &#x41e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x443;&#x43c; &#x442;&#x440;&#x435;&#x43c;&#x44f; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x438;&#x43c;&#x438; ---, &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x447;&#x435;&#x433;&#x43e; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x435;&#x442; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x441;&#x43e;&#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x438;&#x439; &#x437;&#x430;&#x433;&#x43b;&#x430;&#x432;&#x438;&#x44e; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;. &#x41c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x437;&#x430;&#x43a;&#x442;&#x440;&#x44b;&#x442; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x43c;&#x438; --- &#x441; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x438; &#x43e;&#x431; &#x430;&#x432;&#x442;&#x43e;&#x440;&#x435; &#x438; &#x434;&#x430;&#x442;&#x435;. &#x412; &#x43d;&#x430;&#x448;&#x435;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44b;&#x433;&#x43b;&#x44f;&#x434;&#x435;&#x442;&#x44c; &#x442;&#x430;&#x43a;:</p><div class="source"><pre> ----
 &#x421;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x430;&#x439;&#x442;&#x430; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;
 ----
 sody
 ----
 2011-03-15
</pre></div><p>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x44e;, &#x447;&#x442;&#x43e; &#x440;&#x435;&#x43a;&#x43e;&#x43c;&#x435;&#x43d;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x434;&#x430;&#x442;&#x443; &#x432; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x435; ISO-8601, &#x442;.&#x435;. <b>YYYY-MM-DD</b>.</p><p>&#x422;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x440;&#x430;&#x437;&#x43e;&#x431;&#x44c;&#x435;&#x43c; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x43d;&#x430; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x43c;&#x435;&#x43b;&#x43a;&#x438;&#x435; &#x43b;&#x43e;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x441;&#x432;&#x44f;&#x437;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x441;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43d;&#x44b;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438;, &#x441;&#x435;&#x43a;&#x446;&#x438;&#x438;. &#x417;&#x430;&#x433;&#x43e;&#x43b;&#x43e;&#x432;&#x43a;&#x438; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x439; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x44b;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x44e;&#x449;&#x438;&#x439;&#x441;&#x44f; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438;, &#x431;&#x435;&#x437; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x432;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432;, &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x43e;&#x432; &#x442;&#x430;&#x431;&#x443;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x438; &#x442;.&#x434;. &#x41f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44e;&#x442; &#x43d;&#x435;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x443;&#x440;&#x43e;&#x432;&#x43d;&#x435;&#x439; &#x432;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x438;, &#x43a;&#x430;&#x436;&#x434;&#x44b;&#x439; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x439; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x441; &#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e;, &#x434;&#x432;&#x443;&#x445; &#x438; &#x442;.&#x434;. &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x43e;&#x432; *. &#x414;&#x43b;&#x44f; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x44b;&#x445; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x440;&#x435;&#x43a;&#x43e;&#x43c;&#x435;&#x43d;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43f;&#x430;&#x440;&#x430;&#x433;&#x440;&#x430;&#x444;&#x44b; &#x432;&#x43c;&#x435;&#x441;&#x442;&#x43e; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x439;.</p><div class="source"><pre> ----
 &#x421;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x430;&#x439;&#x442;&#x430; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;
 ----
 sody
 ----
 2011-03-15

&#x421;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x430;&#x439;&#x442;&#x430; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;

&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430;

&#x414;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430;

* &#x424;&#x43e;&#x440;&#x43c;&#x430;&#x442; APT

&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x435;&#x433;&#x43e; &#x432;&#x438;&#x434;&#x430;

* &#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x434;&#x435;&#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x440;&#x430; &#x441;&#x430;&#x439;&#x442;&#x430;

* &#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x441;&#x442;&#x438;&#x43b;&#x435;&#x439;

* &#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x448;&#x430;&#x431;&#x43b;&#x43e;&#x43d;&#x430; &#x441;&#x430;&#x439;&#x442;&#x430;
</pre></div><p>&#x421;&#x435;&#x43a;&#x446;&#x438;&#x438; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x44b;, &#x442;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x432; &#x43d;&#x438;&#x445; &#x442;&#x435;&#x43a;&#x441;&#x442;. &#x41b;&#x44e;&#x431;&#x43e;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439;&#x441;&#x44f; &#x432; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x440;&#x430;&#x437;&#x431;&#x438;&#x442; &#x43d;&#x430; &#x43f;&#x430;&#x440;&#x430;&#x433;&#x440;&#x430;&#x444;&#x44b;, &#x431;&#x443;&#x434;&#x44c; &#x442;&#x43e; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x44b;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;, &#x442;&#x435;&#x43a;&#x441;&#x442; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x438; &#x438;&#x43b;&#x438; &#x436;&#x435; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430;. &#x41f;&#x430;&#x440;&#x430;&#x433;&#x440;&#x430;&#x444;&#x44b; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43d;&#x430;&#x431;&#x43e;&#x440; &#x441;&#x442;&#x440;&#x43e;&#x43a; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x430; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x445; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x441;&#x43e;&#x431;&#x43e;&#x439; &#x43f;&#x443;&#x441;&#x442;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x439;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x435; &#x43f;&#x430;&#x440;&#x430;&#x433;&#x440;&#x430;&#x444;&#x430; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x432;&#x441;&#x442;&#x432;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x43a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432;. &#x41a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432; &#x43d;&#x435;&#x437;&#x43d;&#x430;&#x447;&#x438;&#x43c;&#x43e;, &#x43e;&#x434;&#x43d;&#x430;&#x43a;&#x43e; &#x43f;&#x440;&#x438;&#x43d;&#x44f;&#x442;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; 2, &#x438; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x442;&#x44c; &#x43a;&#x430;&#x436;&#x434;&#x443;&#x44e; &#x441;&#x442;&#x440;&#x43e;&#x43a; &#x43f;&#x430;&#x440;&#x430;&#x433;&#x440;&#x430;&#x444;&#x430; &#x44d;&#x442;&#x438;&#x43c;&#x438; &#x434;&#x432;&#x443;&#x43c;&#x44f; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x430;&#x43c;&#x438;.</p><div class="source"><pre> ----
 &#x421;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x430;&#x439;&#x442;&#x430; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;
 ----
 sody
 ----
 2011-03-15

  &#x423;&#x436;&#x435; &#x434;&#x43e;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x43e;&#x43b;&#x433;&#x43e;&#x435; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e; &#x43c;&#x430;&#x432;&#x435;&#x43d; &#x43a;&#x430;&#x43a; &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x434;&#x43b;&#x44f; &#x441;&#x431;&#x43e;&#x440;&#x43a;&#x438; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x43e;&#x432;. &#x418;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43c;&#x435;&#x43d;&#x442;
  &#x44d;&#x442;&#x43e;&#x442; &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43d;&#x44b;&#x439; &#x438; &#x43c;&#x43e;&#x434;&#x43d;&#x44b;&#x439;. &#x41e;&#x43d; &#x43e;&#x441;&#x43e;&#x431;&#x435;&#x43d;&#x43d;&#x43e; &#x43f;&#x43e;&#x43f;&#x443;&#x43b;&#x44f;&#x440;&#x435;&#x43d; &#x441;&#x440;&#x435;&#x434;&#x438; java &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x447;&#x438;&#x43a;&#x43e;&#x432; &#x445;&#x43e;&#x442;&#x44f; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x435;&#x43d; &#x438; &#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445;
  &#x43e;&#x431;&#x43b;&#x430;&#x441;&#x442;&#x44f;&#x445;. &#x422;&#x430;&#x43a; &#x432;&#x43e;&#x442;, &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x44f; &#x445;&#x43e;&#x442;&#x435;&#x43b; &#x431;&#x44b; &#x440;&#x430;&#x441;&#x441;&#x43a;&#x430;&#x437;&#x430;&#x442;&#x44c; &#x43e; &#x442;&#x43e;&#x43c; &#x43a;&#x430;&#x43a; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441; &#x435;&#x433;&#x43e; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x442;&#x44c; &#x441;&#x430;&#x439;&#x442;.

  &#x421;&#x430;&#x439;&#x442; &#x434;&#x43b;&#x44f; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x44b;:

  mvn site
</pre></div><p>&#x418;&#x43d;&#x43e;&#x433;&#x434;&#x430; &#x432;&#x43e;&#x437;&#x43d;&#x438;&#x43a;&#x430;&#x435;&#x442; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x432; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x438; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x43e;&#x432;. &#x414;&#x43b;&#x44f; &#x438;&#x445; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x441; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x430; * &#x438; &#x431;&#x44b;&#x442;&#x44c; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x44b; &#x43f;&#x443;&#x441;&#x442;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x439;, &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x43c; &#x432;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x432;&#x441;&#x442;&#x432;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435;&#x435; &#x43a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432;. &#x412; &#x43d;&#x430;&#x448;&#x435;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x442;&#x443; &#x447;&#x430;&#x441;&#x442;&#x44c;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x43e;&#x43f;&#x438;&#x441;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x44b;, &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43e;&#x444;&#x43e;&#x440;&#x43c;&#x438;&#x442;&#x44c; &#x43a;&#x430;&#x43a; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a;:</p><div class="source"><pre>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430;

  &#x41f;&#x43e; &#x443;&#x43c;&#x43e;&#x43b;&#x447;&#x430;&#x43d;&#x438;&#x44e; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x44b; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x430;&#x439;&#x442;&#x430; &#x445;&#x440;&#x430;&#x43d;&#x44f;&#x442;&#x441;&#x44f; &#x432; src/site &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44b;&#x435; &#x43f;&#x43e; &#x43f;&#x430;&#x43f;&#x43a;&#x430;&#x43c; &#x441; &#x441;&#x43e;&#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x441; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;, &#x43a;&#x43e;&#x438;&#x445;
  &#x432; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x435; &#x446;&#x435;&#x43b;&#x44b;&#x445; 3 &#x448;&#x442;&#x443;&#x43a;&#x438;:

  * APT Format (&quot;Almost Plain Text&quot;). &#x424;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x447;&#x435;&#x43c;-&#x442;&#x43e;
  &#x43d;&#x430;&#x43f;&#x43e;&#x43c;&#x438;&#x43d;&#x430;&#x44e;&#x449;&#x438;&#x439; &#x432;&#x441;&#x435;&#x43c; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x439; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x432;&#x438;&#x43a;&#x438;. &#x41d;&#x430;&#x439;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x441;&#x438;&#x43c;&#x43f;&#x430;&#x442;&#x438;&#x447;&#x43d;&#x44b;&#x439; &#x43c;&#x43d;&#x435;, &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x434;&#x430;&#x43b;&#x435;&#x435; &#x432; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x435; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x432;&#x43d;&#x438;&#x43c;&#x430;&#x43d;&#x438;&#x44f; &#x437;&#x430;&#x43e;&#x441;&#x442;&#x440;&#x44e;
  &#x438;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x43d;&#x430; &#x43d;&#x435;&#x43c;.

  * FML Format (&quot;FAQ Markup Language&quot;). &#x41a;&#x430;&#x43a; &#x44f;&#x441;&#x43d;&#x43e; &#x438;&#x437; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x44f;
  &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; FAQ &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x438;. &#x41f;&#x440;&#x438;&#x448;&#x435;&#x43b; &#x438;&#x437; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;.

  * XDoc format. &#x41f;&#x440;&#x438;&#x448;&#x435;&#x43b; &#x438;&#x437; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;, &#x433;&#x434;&#x435; &#x431;&#x44b;&#x43b; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x43c;/&#x435;&#x434;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;.

  []
</pre></div><p>&#x42d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x44b; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x432;&#x44b;&#x441;&#x43e;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x440;&#x43e;&#x432;&#x43d;&#x44f; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430; &#x438; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x439; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x430;&#x44e;&#x442; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x438;&#x439; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a;. &#x415;&#x441;&#x43b;&#x438; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e; &#x437;&#x430;&#x43a;&#x440;&#x44b;&#x442;&#x44c; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a; &quot;&#x432;&#x440;&#x443;&#x447;&#x43d;&#x443;&#x44e;&quot; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x432;&#x43e;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x43e;&#x43c; [].</p><p>&#x422;&#x430;&#x43a;&#x436;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x432;&#x43e;&#x437;&#x43d;&#x438;&#x43a;&#x43d;&#x443;&#x442;&#x44c; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x43a;&#x430;&#x43a;-&#x442;&#x43e; &#x432;&#x44b;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x44c; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x43b;&#x438;&#x431;&#x43e; &#x43e;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x431;&#x435;&#x437; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;. &#x412; &#x43e;&#x431;&#x43b;&#x430;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x44d;&#x442;&#x43e; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x432;&#x44b;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430;. &#x414;&#x43b;&#x44f; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x443;&#x43c; 3 &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x430; - &#x431;&#x435;&#x437; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x432;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432;.</p><div class="source"><pre>  &#x420;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44b;&#x433;&#x43b;&#x44f;&#x434;&#x435;&#x442;&#x44c; &#x442;&#x430;&#x43a;:

----
+- target/
   +- site/
      +- css/
      |
      +- images/
      |
      +- index.html
      +- general.html
      +- faq.html
      +- other.html
----
</pre></div><p>&#x415;&#x441;&#x43b;&#x438; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b; +, &#x442;&#x43e; &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x442;&#x435;&#x43a;&#x441;&#x442; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43e;&#x431;&#x440;&#x430;&#x43c;&#x43b;&#x435;&#x43d;.</p><p>&#x41d;&#x443; &#x43a;&#x430;&#x43a;&#x43e;&#x439; &#x436;&#x435; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x431;&#x435;&#x437; &#x43a;&#x430;&#x440;&#x442;&#x438;&#x43d;&#x43e;&#x43a;? &#x427;&#x442;&#x43e;&#x431;&#x44b; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x438;&#x442;&#x44c; &#x43a;&#x430;&#x440;&#x442;&#x438;&#x43d;&#x43a;&#x443; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e; &#x43f;&#x443;&#x442;&#x44c; &#x43a; &#x444;&#x430;&#x439;&#x43b;&#x443; &#x437;&#x430;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x44c; &#x432; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b; [], &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x43c; &#x43d;&#x435; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x432;&#x441;&#x442;&#x432;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x44b;, &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x447;&#x435;&#x433;&#x43e; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x441;&#x43b;&#x435;&#x434;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43a;&#x430;&#x440;&#x442;&#x438;&#x43d;&#x43a;&#x438;.</p><div class="source"><pre>[images/sample-site.jpg] Example Site
</pre></div><p>&#x415;&#x441;&#x43b;&#x438; &#x431;&#x44b; &#x43d;&#x430;&#x43c; &#x43f;&#x43e;&#x43d;&#x430;&#x434;&#x43e;&#x431;&#x438;&#x43b;&#x430;&#x441;&#x44c; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x430;, &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x431;&#x44b;&#x43b;&#x43e; &#x431;&#x44b; &#x432;&#x43e;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x43c; &#x441;&#x438;&#x43d;&#x442;&#x430;&#x43a;&#x441;&#x438;&#x441;&#x43e;&#x43c;:</p><div class="source"><pre>*----------*--------------*----------------*
|| &#x424;&#x430;&#x43c;&#x438;&#x43b;&#x438;&#x44f; || &#x418;&#x43c;&#x44f;         || &#x41e;&#x442;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43e;      |
*----------*--------------*----------------*
| &#x418;&#x432;&#x430;&#x43d;&#x43e;&#x432;   | &#x418;&#x432;&#x430;&#x43d;         | &#x418;&#x432;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x447;       |
*----------*--------------*----------------*
| &#x41f;&#x435;&#x442;&#x440;&#x43e;&#x432;   | &#x41f;&#x435;&#x442;&#x440;         | &#x41f;&#x435;&#x442;&#x440;&#x43e;&#x432;&#x438;&#x447;       |
*----------*--------------*----------------*
| &#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432;  | &#x421;&#x438;&#x434;&#x43e;&#x440;        | &#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432;&#x438;&#x447;      |
*----------*--------------*----------------*
&#x421;&#x442;&#x443;&#x434;&#x435;&#x43d;&#x442;&#x44b;
</pre></div><p>&#x418;&#x43b;&#x438; &#x442;&#x430;&#x43a;:</p><div class="source"><pre>*----------------:--------------+
|| &#x424;&#x418;&#x41e;           | &#x418;&#x432;&#x430;&#x43d;&#x43e;&#x432; &#x418;.&#x418;.  |
*----------------:--------------+
|| &#x414;&#x430;&#x442;&#x430; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; | 26.03.1989   |
*----------------:--------------+
|| &#x413;&#x440;&#x443;&#x43f;&#x43f;&#x430;        | 651003       |
*----------------:--------------+
&#x41a;&#x430;&#x440;&#x442;&#x430; &#x441;&#x442;&#x443;&#x434;&#x435;&#x43d;&#x442;&#x430;
</pre></div><p>&#x422;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x430; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x430; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x439; *-- &#x431;&#x435;&#x437; &#x43f;&#x440;&#x435;&#x434;&#x448;&#x435;&#x432;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432;, &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x44b; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x431;&#x44b;&#x442;&#x44c; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x44b; &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x436;&#x435; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x439; *--. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x435; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x44b; &#x434;&#x43b;&#x44f; &#x432;&#x44b;&#x440;&#x430;&#x432;&#x43d;&#x438;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x430;:</p><ul><li>* &#x434;&#x43b;&#x44f; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;</li><li>+ &#x434;&#x43b;&#x44f; &#x432;&#x44b;&#x440;&#x430;&#x432;&#x43d;&#x438;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x43e; &#x43b;&#x435;&#x432;&#x43e;&#x43c;&#x443; &#x43a;&#x440;&#x430;&#x44e;</li><li>: &#x434;&#x43b;&#x44f; &#x432;&#x44b;&#x440;&#x430;&#x432;&#x43d;&#x438;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x43e; &#x43f;&#x440;&#x430;&#x432;&#x43e;&#x43c;&#x443; &#x43a;&#x440;&#x430;&#x44e;</li></ul><p>&#x417;&#x430;&#x433;&#x43e;&#x43b;&#x43e;&#x432;&#x43a;&#x438; &#x43a;&#x43e;&#x43b;&#x43e;&#x43d;&#x43e;&#x43a; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x438;&#x442;&#x44c; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x430; |.</p><p>&#x422;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x43c; &#x43a; &#x43d;&#x430;&#x448;&#x435;&#x43c;&#x443; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x443; &#x441;&#x441;&#x44b;&#x43b;&#x43a;&#x438; &#x43d;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44b;/&#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b;/&#x441;&#x435;&#x43a;&#x446;&#x438;&#x438; &#x44d;&#x442;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b;. &#x427;&#x442;&#x43e;&#x431;&#x44b; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x441;&#x44b;&#x43b;&#x43e;&#x43a; &#x43d;&#x430; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x44f;&#x43a;&#x43e;&#x440;&#x44f;(anchor). &#x414;&#x43b;&#x44f; &#x438;&#x445; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x43e;&#x434;&#x438;&#x43d;&#x43e;&#x447;&#x43d;&#x44b;&#x435; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b; {}. &#x41f;&#x43e; &#x442;&#x43e;&#x43c;&#x443;, &#x447;&#x442;&#x43e; &#x437;&#x430;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x43e; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x43d;&#x438;&#x43c;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d; &#x44f;&#x43a;&#x43e;&#x440;&#x44c;. &#x417;&#x430;&#x43c;&#x435;&#x447;&#x443;, &#x447;&#x442;&#x43e; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x438;&#x441;&#x445;&#x43e;&#x434;&#x438;&#x442; &#x441; &#x437;&#x430;&#x43c;&#x435;&#x43d;&#x43e;&#x439; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432; &#x43d;&#x430; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b; &#x43f;&#x43e;&#x434;&#x447;&#x435;&#x440;&#x43a;&#x438;&#x432;&#x430;&#x43d;&#x438;&#x44f;. &#x414;&#x43b;&#x44f; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x441;&#x44b;&#x43b;&#x43e;&#x43a; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x442;&#x435; &#x436;&#x435; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b;, &#x43d;&#x43e; &#x434;&#x432;&#x430;&#x436;&#x434;&#x44b; {{}}. &#x41c;&#x435;&#x436;&#x434;&#x443; &#x43d;&#x438;&#x43c;&#x438; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43d;&#x430;&#x445;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x438;&#x43c;&#x44f; &#x44f;&#x43a;&#x43e;&#x440;&#x44f;, &#x43e;&#x442;&#x43d;&#x43e;&#x441;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x430;&#x44f; &#x441;&#x441;&#x44b;&#x43b;&#x43a;&#x430; &#x43d;&#x430; &#x434;&#x440;&#x443;&#x433;&#x443;&#x44e; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x443; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x430; &#x438;&#x43b;&#x438; &#x43f;&#x440;&#x438;&#x432;&#x44b;&#x447;&#x43d;&#x430;&#x44f; &#x441;&#x441;&#x44b;&#x43b;&#x43a;&#x430; &#x43d;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43e;&#x439; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x44f;&#x442;&#x44c; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x441;&#x44b;&#x43b;&#x43a;&#x438; &#x432;&#x437;&#x44f;&#x432; &#x432;&#x441;&#x435; &#x432; &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x44b;&#x435; {{}} + &#x432;&#x437;&#x44f;&#x442;&#x44c; &#x441;&#x441;&#x44b;&#x43b;&#x43a;&#x443; &#x431;&#x435;&#x437; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x435;&#x449;&#x435; &#x432; &#x43e;&#x434;&#x43d;&#x438; {}.</p><div class="source"><pre>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x43d;&#x442;&#x430;

  &#x41f;&#x43e; &#x443;&#x43c;&#x43e;&#x43b;&#x447;&#x430;&#x43d;&#x438;&#x44e; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x44b; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x430;&#x439;&#x442;&#x430; &#x445;&#x440;&#x430;&#x43d;&#x44f;&#x442;&#x441;&#x44f; &#x432; src/site &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44b;&#x435; &#x43f;&#x43e; &#x43f;&#x430;&#x43f;&#x43a;&#x430;&#x43c; &#x441; &#x441;&#x43e;&#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x441; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;, &#x43a;&#x43e;&#x438;&#x445;
  &#x432; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x435; &#x446;&#x435;&#x43b;&#x44b;&#x445; 3 &#x448;&#x442;&#x443;&#x43a;&#x438;:

  * {{{http://maven.apache.org/doxia/references/apt-format.html}APT Format}} (&quot;Almost Plain Text&quot;). &#x424;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x447;&#x435;&#x43c;-&#x442;&#x43e;
  &#x43d;&#x430;&#x43f;&#x43e;&#x43c;&#x438;&#x43d;&#x430;&#x44e;&#x449;&#x438;&#x439; &#x432;&#x441;&#x435;&#x43c; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x439; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x432;&#x438;&#x43a;&#x438;. &#x41d;&#x430;&#x439;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x441;&#x438;&#x43c;&#x43f;&#x430;&#x442;&#x438;&#x447;&#x43d;&#x44b;&#x439; &#x43c;&#x43d;&#x435;, &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x434;&#x430;&#x43b;&#x435;&#x435; &#x432; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x435; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x432;&#x43d;&#x438;&#x43c;&#x430;&#x43d;&#x438;&#x44f; &#x437;&#x430;&#x43e;&#x441;&#x442;&#x440;&#x44e;
  &#x438;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x43d;&#x430; &#x43d;&#x435;&#x43c;.

  * {{{http://maven.apache.org/doxia/references/fml-format.html}FML Format}} (&quot;FAQ Markup Language&quot;). &#x41a;&#x430;&#x43a; &#x44f;&#x441;&#x43d;&#x43e; &#x438;&#x437; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x44f;
  &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; FAQ &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x438;. &#x41f;&#x440;&#x438;&#x448;&#x435;&#x43b; &#x438;&#x437; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;.

  * {{{http://maven.apache.org/doxia/references/xdoc-format.html}XDoc format}}. &#x41f;&#x440;&#x438;&#x448;&#x435;&#x43b; &#x438;&#x437; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x430;&#x432;&#x435;&#x43d;&#x430;, &#x433;&#x434;&#x435; &#x431;&#x44b;&#x43b;
  &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x43c;/&#x435;&#x434;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;.

  []
</pre></div><p>&#x41d;&#x443; &#x438; &#x432; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43d;&#x438;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x448;&#x440;&#x438;&#x444;&#x442;. &#x41e;&#x434;&#x438;&#x43d;&#x43e;&#x447;&#x43d;&#x44b;&#x43c;&#x438; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x430;&#x43c;&#x438; &lt;&gt; &#x43e;&#x431;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43a;&#x443;&#x440;&#x441;&#x438;&#x432;, &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x44b;&#x43c;&#x438; &lt;&lt;&gt;&gt; - &#x436;&#x438;&#x440;&#x43d;&#x44b;&#x439;, &#x442;&#x440;&#x43e;&#x439;&#x43d;&#x44b;&#x43c;&#x438; &lt;&lt;&lt;&gt;&gt;&gt; - monospaced.</p><div class="source"><pre>  &#x414;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x44e;, &#x447;&#x442;&#x43e; &#x440;&#x435;&#x43a;&#x43e;&#x43c;&#x435;&#x43d;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x434;&#x430;&#x442;&#x443; &#x432; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x435; ISO-8601, &#x442;.&#x435;. &lt;&lt;YYYY-MM-DD&gt;&gt;.
</pre></div><p>&#x412; &#x438;&#x442;&#x43e;&#x433;&#x435; &#x43c;&#x44b; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x438;&#x43c; &#x447;&#x442;&#x43e;-&#x442;&#x43e; &#x432;&#x440;&#x43e;&#x434;&#x435; &#x44d;&#x442;&#x43e;&#x433;&#x43e;:</p><img src="images/sample-site.png" alt="&#x421;&#x430;&#x439;&#x442;." /><p>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x43c; &#x435;&#x449;&#x435; &#x43d;&#x435;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446; &#x438; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x435;&#x440;&#x435;&#x445;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x43a; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x435; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x435;&#x433;&#x43e; &#x432;&#x438;&#x434;&#x430;.</p><p>&#x417;&#x430; &#x43f;&#x43e;&#x434;&#x440;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x44f;&#x43c;&#x438; <a class="externalLink" href="http://maven.apache.org/doxia/references/apt-format.html">&#x441;&#x44e;&#x434;&#x430;</a>.</p></div></div><div class="section"><h2>&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x435;&#x433;&#x43e; &#x432;&#x438;&#x434;&#x430;<a name="a__"></a></h2><p>&#x414;&#x43b;&#x44f; &#x442;&#x43e;&#x433;&#x43e; &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x438;&#x442;&#x44c; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x438;&#x439; &#x432;&#x438;&#x434; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; 3 &#x432;&#x435;&#x449;&#x438;:</p><ol style="list-style-type: decimal"><li>&#x41f;&#x435;&#x440;&#x435;&#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x44c; CSS &#x441;&#x442;&#x438;&#x43b;&#x438; &#x432; site.css &#x43f;&#x43e;&#x434; &#x441;&#x432;&#x43e;&#x438; &#x43d;&#x443;&#x436;&#x434;&#x44b;.</li><li>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x434;&#x435;&#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x440; &#x441;&#x430;&#x439;&#x442;&#x430; (site.xml). &#x412; &#x43d;&#x435;&#x43c; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x437;&#x430;&#x434;&#x430;&#x442;&#x44c;/&#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x435; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x44b; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x442;&#x43a;&#x438; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b;, &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x438;&#x442;&#x44c; &#x43c;&#x435;&#x43d;&#x44e; &#x43d;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x438;.</li><li>&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x438;&#x442;&#x44c; &#x448;&#x430;&#x431;&#x43b;&#x43e;&#x43d; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b;, &#x432; &#x44d;&#x442;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x43b;&#x43d;&#x43e;&#x441;&#x442;&#x44c;&#x44e; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x443;&#x44e; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x443;.</li></ol><div class="section"><h3>&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x441;&#x442;&#x438;&#x43b;&#x435;&#x439;<a name="a_"></a></h3><p>&#x421;&#x430;&#x43c;&#x43e;&#x435; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x435;, &#x447;&#x442;&#x43e; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c;, &#x44d;&#x442;&#x43e; &#x43f;&#x435;&#x440;&#x435;&#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x44c; CSS &#x441;&#x442;&#x438;&#x43b;&#x438; &#x43d;&#x430; &#x43d;&#x443;&#x436;&#x43d;&#x44b;&#x435; &#x43d;&#x430;&#x43c;. &#x412;&#x441;&#x435; &#x447;&#x442;&#x43e; &#x43d;&#x430;&#x434;&#x43e; - &#x441;&#x43e;&#x437;&#x434;&#x430;&#x442;&#x44c; &#x444;&#x430;&#x439;&#x43b; site.css, &#x430; &#x434;&#x430;&#x43b;&#x44c;&#x448;&#x435; &#x443;&#x436;&#x435; &#x43a;&#x442;&#x43e; &#x43d;&#x430; &#x447;&#x442;&#x43e; &#x433;&#x43e;&#x440;&#x430;&#x437;&#x434;. &#x423; &#x441;&#x435;&#x431;&#x44f; &#x432; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x435; &#x432;&#x437;&#x44f;&#x43b; &#x437;&#x430; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x443; &#x441;&#x442;&#x438;&#x43b;&#x438; &#x43f;&#x43e;&#x445;&#x43e;&#x436;&#x438;&#x435; &#x43d;&#x430; &#x442;&#x435; &#x447;&#x442;&#x43e; &#x43d;&#x430; &#x445;&#x430;&#x431;&#x440;&#x435;.</p></div><div class="section"><h3>&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x434;&#x435;&#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x440;&#x430; &#x441;&#x430;&#x439;&#x442;&#x430;<a name="a__"></a></h3><p>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x43c; &#x444;&#x430;&#x439;&#x43b; &#x434;&#x435;&#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x440;&#x430; &#x441;&#x430;&#x439;&#x442;&#x430;(site.xml) &#x432; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;.</p><div class="source"><pre>&lt;project xmlns=&quot;http://maven.apache.org/DECORATION/1.0.0&quot;
   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
   xsi:schemaLocation=&quot;http://maven.apache.org/DECORATION/1.0.0 http://maven.apache.org/xsd/decoration-1.0.0.xsd&quot;&gt;

  &lt;body&gt;
    &lt;menu name=&quot;&#x421;&#x442;&#x430;&#x442;&#x44c;&#x438;&quot;&gt;
      &lt;item name=&quot;&#x421;&#x442;&#x430;&#x442;&#x44c;&#x44f;&quot; href=&quot;index.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 0&quot; href=&quot;sample0.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 1&quot; href=&quot;sample1.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 2&quot; href=&quot;sample2.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 4&quot; href=&quot;sample3.html&quot;/&gt;
    &lt;/menu&gt;
  &lt;/body&gt;
&lt;/project&gt;
</pre></div><p>&#x412; &#x44d;&#x442;&#x43e;&#x43c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x435; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43d;&#x43e; &#x431;&#x43e;&#x43a;&#x43e;&#x432;&#x43e;&#x435; &#x43c;&#x435;&#x43d;&#x44e;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x441;&#x43e;&#x441;&#x442;&#x43e;&#x438;&#x442; &#x438;&#x437; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x438; <i>&#x421;&#x442;&#x430;&#x442;&#x44c;&#x438;</i>, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x432; &#x441;&#x432;&#x43e;&#x44e; &#x43e;&#x447;&#x435;&#x440;&#x435;&#x434;&#x44c; &#x441;&#x43e;&#x441;&#x442;&#x43e;&#x438;&#x442; &#x438;&#x437; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x421;&#x442;&#x430;&#x442;&#x44c;&#x44f; &#x438; &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 0-4. &#x41c;&#x43e;&#x436;&#x43d;&#x43e; &#x440;&#x430;&#x437;&#x431;&#x438;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x43d;&#x430; &#x43d;&#x435;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x441;&#x435;&#x43a;&#x446;&#x438;&#x439;:</p><div class="source"><pre>&lt;project xmlns=&quot;http://maven.apache.org/DECORATION/1.0.0&quot;
   xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;
   xsi:schemaLocation=&quot;http://maven.apache.org/DECORATION/1.0.0 http://maven.apache.org/xsd/decoration-1.0.0.xsd&quot;&gt;

  &lt;body&gt;
    &lt;menu name=&quot;&#x421;&#x442;&#x430;&#x442;&#x44c;&#x438;&quot;&gt;
      &lt;item name=&quot;&#x421;&#x442;&#x430;&#x442;&#x44c;&#x44f;&quot; href=&quot;index.html&quot;/&gt;
    &lt;/menu&gt;
    &lt;menu name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x44b;&quot;&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 0&quot; href=&quot;sample0.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 1&quot; href=&quot;sample1.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 2&quot; href=&quot;sample2.html&quot;/&gt;
      &lt;item name=&quot;&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; 4&quot; href=&quot;sample3.html&quot;/&gt;
    &lt;/menu&gt;
  &lt;/body&gt;
&lt;/project&gt;
</pre></div><p>&#x41a;&#x440;&#x43e;&#x43c;&#x435; &#x43c;&#x435;&#x43d;&#x44e; &#x435;&#x441;&#x442;&#x44c; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43c;&#x438; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x43c;&#x438;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f;, &#x434;&#x430;&#x442;&#x430; &#x43f;&#x443;&#x431;&#x43b;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438;, &#x431;&#x430;&#x43d;&#x43d;&#x435;&#x440;&#x44b;, &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x430; &#x43d;&#x430;&#x432;&#x438;&#x433;&#x430;&#x446;&#x438;&#x438; &#x438; &#x442;.&#x434;.</p><div class="source"><pre>  &lt;version position=&quot;none&quot;/&gt;
  &lt;publishDate position=&quot;navigation-bottom&quot; format=&quot;yyyy-MM-dd&quot;/&gt;
</pre></div><p>&#x415;&#x441;&#x43b;&#x438; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x44d;&#x442;&#x438; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438;, &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x430; &#x43d;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x438;&#x434;&#x43d;&#x430;, &#x430; &#x434;&#x430;&#x442;&#x430; &#x43f;&#x443;&#x431;&#x43b;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x441;&#x43f;&#x43e;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x430; &#x43f;&#x43e;&#x434; &#x43c;&#x435;&#x43d;&#x44e; &#x441; &#x443;&#x43a;&#x430;&#x437;&#x430;&#x43d;&#x43d;&#x44b;&#x43c; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x43c;. &#x41a;&#x440;&#x43e;&#x43c;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x43e;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x43a; &#x441;&#x430;&#x439;&#x442;&#x443; &#x434;&#x440;&#x443;&#x433;&#x43e;&#x439; &#x441;&#x43a;&#x438;&#x43d;:</p><div class="source"><pre>  &lt;skin&gt;
    &lt;groupId&gt;org.apache.maven.skins&lt;/groupId&gt;
    &lt;artifactId&gt;maven-classic-skin&lt;/artifactId&gt;
    &lt;version&gt;1.0&lt;/version&gt;
  &lt;/skin&gt;
</pre></div><p>&#x412; &#x438;&#x442;&#x43e;&#x433;&#x435; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x438;&#x439; &#x432;&#x438;&#x434; &#x441;&#x430;&#x439;&#x442;&#x430; &#x43f;&#x43e;&#x43c;&#x435;&#x43d;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x434;&#x43e; &#x442;&#x430;&#x43a;&#x43e;&#x433;&#x43e;:</p><img src="images/sample-site0.png" alt="&#x41a;&#x43b;&#x430;&#x441;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x439; &#x441;&#x43a;&#x438;&#x43d;" /><p>&#x417;&#x430; &#x43f;&#x43e;&#x434;&#x440;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x44f;&#x43c;&#x438; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438; <a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/examples/sitedescriptor.html">&#x441;&#x44e;&#x434;&#x430;</a>.</p></div><div class="section"><h3>&#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x448;&#x430;&#x431;&#x43b;&#x43e;&#x43d;&#x430; &#x441;&#x430;&#x439;&#x442;&#x430;<a name="a__"></a></h3><p>&#x428;&#x430;&#x431;&#x43b;&#x43e;&#x43d; &#x441;&#x430;&#x439;&#x442;&#x430; &#x44d;&#x442;&#x43e; &#x441;&#x440;&#x438;&#x43f;&#x442; &#x43d;&#x430; <a class="externalLink" href="http://velocity.apache.org/">velocity</a>, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x43e;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x437;&#x430; &#x43f;&#x440;&#x435;&#x43e;&#x431;&#x440;&#x430;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x430; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x438;&#x439; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;, &#x432; &#x43d;&#x430;&#x448;&#x435;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x432; html. &#x417;&#x434;&#x435;&#x441;&#x44c; &#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43d;&#x44e;&#x430;&#x43d;&#x441;&#x43e;&#x432;, &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x43d;&#x435; &#x431;&#x443;&#x434;&#x443; &#x440;&#x430;&#x441;&#x441;&#x43c;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x432; &#x44d;&#x442;&#x43e;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x435;, &#x43f;&#x43e;&#x43a;&#x430;&#x436;&#x443; &#x43b;&#x438;&#x448;&#x44c; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e; &#x443; &#x43c;&#x435;&#x43d;&#x44f; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x438;&#x43b;&#x43e;&#x441;&#x44c;:</p><img src="images/sample-site1.png" alt="&#x41a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x44b;&#x439; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442; &#x441;&#x430;&#x439;&#x442;&#x430;" /><p>&#x418;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x43a;&#x43e;&#x434;&#x44b; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43d;&#x430;&#x439;&#x442;&#x438; &#x43d;&#x430; <a class="externalLink" href="https://github.com/sody/samples/tree/master/site">&#x433;&#x438;&#x442;&#x445;&#x430;&#x431;&#x435;</a>.</p><p>&#x421;&#x441;&#x44b;&#x43b;&#x43a;&#x438;:</p><ul><li><a class="externalLink" href="http://maven.apache.org/">http://maven.apache.org/</a></li><li><a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/">http://maven.apache.org/plugins/maven-site-plugin/</a></li><li><a class="externalLink" href="http://maven.apache.org/doxia/references/apt-format.html">http://maven.apache.org/doxia/references/apt-format.html</a></li><li><a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/examples/creating-content.html">http://maven.apache.org/plugins/maven-site-plugin/examples/creating-content.html</a></li><li><a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/examples/sitedescriptor.html">http://maven.apache.org/plugins/maven-site-plugin/examples/sitedescriptor.html</a></li><li><a class="externalLink" href="http://maven.apache.org/plugins/maven-site-plugin/examples/templatefile.html">http://maven.apache.org/plugins/maven-site-plugin/examples/templatefile.html</a></li></ul></div></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                    2011
                        <a href="http://sody.github.com/">sody</a>.
            All Rights Reserved.      
                
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
