<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia at 04.05.2011 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ru" lang="ru">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Sody's Site - Инверсия управления</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="Мартин Фоулер" />
    <meta name="Date-Creation-yyyymmdd" content="20050626" />
    <meta name="Date-Revision-yyyymmdd" content="20110504" />
    <meta http-equiv="Content-Language" content="ru" />
        

          <!-- Google Analytics -->
    <script type="text/javascript">
    
      var _gaq = _gaq || [];
      _gaq.push(['_setAccount', 'UA-23122478-1']);
      _gaq.push(['_trackPageview']);

      (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
      })();

    </script>
    </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                Sody's Site
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
                
                <div class="xleft">
        <span id="publishDate">Last Published: 2011-05-04</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="../index.html" title="English">English</a>
            |
                        <a href="index.html" title="Русский">Русский</a>
              
                
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
                
                                <h5>Статьи</h5>
                  <ul>
                  <li class="none">
                          <a href="site.html" title="Создание сайта средствами мавена">Создание сайта средствами мавена</a>
            </li>
                  <li class="none">
                          <a href="spi.html" title="Использование SPI механизма">Использование SPI механизма</a>
            </li>
          </ul>
                       <h5>Переводы</h5>
                  <ul>
                  <li class="none">
            <strong>Инверсия управления</strong>
          </li>
                  <li class="none">
                          <a href="injection.html" title="Внедрение зависимостей">Внедрение зависимостей</a>
            </li>
                  <li class="none">
                          <a href="performance.html" title="Лучшие способы ускорить сайт">Лучшие способы ускорить сайт</a>
            </li>
          </ul>
                       <h5>Проекты</h5>
                  <ul>
                  <li class="none">
                          <a href="../greatage/ru/index.html" title="Great Age">Great Age</a>
            </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section"><h2>&#x418;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;<a name="a_"></a></h2><p>&#x418;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x440;&#x430;&#x441;&#x43f;&#x43e;&#x441;&#x442;&#x440;&#x430;&#x43d;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x44f;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435;&#x43c;, &#x441; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x43c; &#x432;&#x44b; &#x441;&#x442;&#x43e;&#x43b;&#x43a;&#x43d;&#x435;&#x442;&#x435;&#x441;&#x44c; &#x43f;&#x440;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x438; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x43e;&#x432;. &#x418; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;, &#x43e;&#x43d;&#x430; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x440;&#x430;&#x441;&#x441;&#x43c;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x44f;&#x44e;&#x449;&#x430;&#x44f; &#x445;&#x430;&#x440;&#x430;&#x43a;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43a;&#x430; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430;.</p><p>&#x414;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x43c; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;. &#x41f;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x44c;&#x442;&#x435; &#x441;&#x435;&#x431;&#x435; &#x447;&#x442;&#x43e; &#x44f; &#x43f;&#x438;&#x448;&#x443; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x443;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x430;&#x435;&#x442; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x443;&#x44e; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44e; &#x43e;&#x442; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438;. &#x42f; &#x43c;&#x43e;&#x433; &#x431;&#x44b; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x44d;&#x442;&#x43e; &#x43a;&#x430;&#x43a;-&#x442;&#x43e; &#x442;&#x430;&#x43a;:</p><div class="source"><pre>  #ruby
  puts 'What is your name?'
  name = gets
  process_name(name)
  puts 'What is your quest?'
  quest = gets
  process_quest(quest)
</pre></div><p>&#x412; &#x44d;&#x442;&#x43e;&#x439; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x438; &#x43c;&#x43e;&#x439; &#x43a;&#x43e;&#x434; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x44f;&#x435;&#x442; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x435;&#x43c;: &#x43e;&#x43d; &#x440;&#x435;&#x448;&#x430;&#x435;&#x442;, &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x432;&#x43e;&#x43f;&#x440;&#x43e;&#x441;&#x44b;, &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x441;&#x447;&#x438;&#x442;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x43e;&#x442;&#x432;&#x435;&#x442;&#x44b;, &#x430; &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x43e;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x44b;.</p><p>&#x41e;&#x434;&#x43d;&#x430;&#x43a;&#x43e;, &#x435;&#x441;&#x43b;&#x438; &#x431;&#x44b; &#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43b; &#x43e;&#x43a;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x443; &#x434;&#x43b;&#x44f; &#x447;&#x435;&#x433;&#x43e;-&#x442;&#x43e; &#x43f;&#x43e;&#x445;&#x43e;&#x436;&#x435;&#x433;&#x43e;, &#x44f; &#x43d;&#x430;&#x43f;&#x438;&#x441;&#x430;&#x43b; &#x431;&#x44b; &#x447;&#x442;&#x43e;-&#x442;&#x43e;, &#x447;&#x442;&#x43e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x441; &#x43e;&#x43a;&#x43d;&#x43e;&#x43c;:</p><div class="source"><pre>  require 'tk'
  root = TkRoot.new()
  name_label = TkLabel.new() {text &quot;What is Your Name?&quot;}
  name_label.pack
  name = TkEntry.new(root).pack
  name.bind(&quot;FocusOut&quot;) {process_name(name)}
  quest_label = TkLabel.new() {text &quot;What is Your Quest?&quot;}
  quest_label.pack
  quest = TkEntry.new(root).pack
  quest.bind(&quot;FocusOut&quot;) {process_quest(quest)}
  Tk.mainloop()
</pre></div><p>&#x422;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x44d;&#x442;&#x438;&#x43c;&#x438; &#x434;&#x432;&#x443;&#x43c;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x430;&#x43c;&#x438; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x430;&#x44f; &#x440;&#x430;&#x437;&#x43d;&#x438;&#x446;&#x430; &#x432; &#x43f;&#x43e;&#x442;&#x43e;&#x43a;&#x435; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; - &#x432; &#x447;&#x430;&#x441;&#x442;&#x43d;&#x43e;&#x441;&#x442;&#x438;, &#x432; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x438; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x435;&#x43c; &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; <tt>process_name</tt> &#x438; <tt>process_quest</tt>. &#x412; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x435; &#x441; &#x43a;&#x43e;&#x43c;&#x43c;&#x430;&#x43d;&#x434;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x439; &#x44f; &#x43a;&#x43e;&#x43d;&#x442;&#x440;&#x43e;&#x43b;&#x438;&#x440;&#x443;&#x44e;, &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x44d;&#x442;&#x438; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x44e;&#x442;&#x441;&#x44f;, &#x43d;&#x43e; &#x432; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x435; &#x441; &#x43e;&#x43a;&#x43e;&#x43d;&#x43d;&#x44b;&#x43c; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x43d;&#x435;&#x442;. &#x412;&#x43c;&#x435;&#x441;&#x442;&#x43e; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x44f; &#x43f;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44e; &#x43a;&#x43e;&#x43d;&#x442;&#x440;&#x43e;&#x43b;&#x44c; &#x43e;&#x43a;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x435; (&#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x430; <tt>Tk.mainloop</tt>). &#x414;&#x430;&#x43b;&#x435;&#x435; &#x43e;&#x43d;&#x430; &#x440;&#x435;&#x448;&#x430;&#x435;&#x442; &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x432;&#x44b;&#x437;&#x432;&#x430;&#x442;&#x44c; &#x43c;&#x43e;&#x438; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b;, &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x44b;&#x432;&#x430;&#x44f;&#x441;&#x44c; &#x43d;&#x430; &#x441;&#x432;&#x44f;&#x437;&#x44f;&#x445;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x44f; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x438;&#x43b; &#x43f;&#x440;&#x438; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x438; &#x444;&#x43e;&#x440;&#x43c;&#x44b;. &#x423;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43e; - &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x44f;&#x44e;&#x442; &#x43c;&#x43d;&#x43e;&#x439;, &#x430; &#x43d;&#x435; &#x44f; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x44f;&#x44e; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x43e;&#x43c;. &#x42d;&#x442;&#x43e; &#x44f;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x438; &#x43d;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x435;&#x439; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; (&#x442;&#x430;&#x43a;&#x436;&#x435; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x43e; &#x43a;&#x430;&#x43a; &#x41f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f; &#x413;&#x43e;&#x43b;&#x43b;&#x438;&#x432;&#x443;&#x434;&#x430; - &quot;&#x41d;&#x435; &#x437;&#x432;&#x43e;&#x43d;&#x438; &#x43d;&#x430;&#x43c;, &#x43c;&#x44b; &#x441;&#x430;&#x43c;&#x438; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43d;&#x438;&#x43c; &#x442;&#x435;&#x431;&#x435;&quot; - <i>Hollywood Principle - &quot;Don't call us, we'll call you&quot;</i>).</p><p><i>&#x41e;&#x434;&#x43d;&#x43e;&#x439; &#x432;&#x430;&#x436;&#x43d;&#x43e;&#x439; &#x445;&#x430;&#x440;&#x430;&#x43a;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43a;&#x43e;&#x439; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x442;&#x43e;, &#x447;&#x442;&#x43e; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b;, &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x435;&#x43c; &#x434;&#x43b;&#x44f; &#x430;&#x434;&#x430;&#x43f;&#x442;&#x430;&#x446;&#x438;&#x438; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430; &#x43f;&#x43e;&#x434; &#x441;&#x432;&#x43e;&#x438; &#x43d;&#x443;&#x436;&#x434;&#x44b;, &#x431;&#x443;&#x434;&#x443;&#x442; &#x447;&#x430;&#x449;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x432;&#x43d;&#x443;&#x442;&#x440;&#x438; &#x441;&#x430;&#x43c;&#x43e;&#x433;&#x43e; &#x436;&#x435; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430;, &#x430; &#x43d;&#x435; &#x438;&#x437; &#x43a;&#x43e;&#x434;&#x430; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;. &#x424;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x438;&#x433;&#x440;&#x430;&#x435;&#x442; &#x440;&#x43e;&#x43b;&#x44c; &#x433;&#x43b;&#x430;&#x432;&#x43d;&#x43e;&#x439; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x44b; &#x432; &#x43a;&#x43e;&#x43e;&#x440;&#x434;&#x438;&#x43d;&#x430;&#x446;&#x438;&#x438; &#x438; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f;. &#x422;&#x430;&#x43a;&#x430;&#x44f; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x430;&#x435;&#x442; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x443; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x441;&#x43b;&#x443;&#x436;&#x438;&#x442;&#x44c; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44f;&#x435;&#x43c;&#x44b;&#x43c; &#x441;&#x43a;&#x435;&#x43b;&#x435;&#x442;&#x43e;&#x43c; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f;. &#x41c;&#x435;&#x442;&#x43e;&#x434;&#x44b;, &#x43f;&#x440;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x435;&#x43c;&#x44b;&#x435; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x435;&#x43c;, &#x430;&#x434;&#x430;&#x43f;&#x442;&#x438;&#x440;&#x443;&#x44e;&#x442; &#x43e;&#x431;&#x449;&#x438;&#x435; &#x430;&#x43b;&#x433;&#x43e;&#x440;&#x438;&#x442;&#x43c;&#x44b;, &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x43e;&#x43c;, &#x43f;&#x43e;&#x434; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x43e;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;.</i> <i>--&#x420;&#x430;&#x43b;&#x44c;&#x444; &#x414;&#x436;&#x43e;&#x43d;&#x441;&#x43e;&#x43d; &#x438; &#x411;&#x440;&#x430;&#x439;&#x430;&#x43d; &#x424;&#x443;&#x442;</i></p><p>&#x418;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x432;&#x43e;&#x439; &#x447;&#x430;&#x441;&#x442;&#x44c;&#x44e; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x430;&#x435;&#x442; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a; &#x438; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x443;. &#x411;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x430; &#x44d;&#x442;&#x43e; &#x43f;&#x43e; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443; &#x43d;&#x430;&#x431;&#x43e;&#x440; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x439;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x432;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x442;&#x44c;, &#x432; &#x43d;&#x430;&#x448;&#x438; &#x434;&#x43d;&#x438; &#x43e;&#x43d;&#x438; &#x43e;&#x440;&#x433;&#x430;&#x43d;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x44b; &#x432; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x44b;. &#x41a;&#x430;&#x436;&#x434;&#x44b;&#x439; &#x432;&#x44b;&#x437;&#x43e;&#x432; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x442; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x443;&#x44e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x443; &#x438; &#x432;&#x43e;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43e;&#x431;&#x440;&#x430;&#x442;&#x43d;&#x43e; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44e;.</p><p>&#x424;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a; &#x432;&#x43e;&#x43f;&#x43b;&#x43e;&#x449;&#x430;&#x435;&#x442; &#x432; &#x441;&#x435;&#x431;&#x435; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x44b;&#x439; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43d; &#x441;&#x43e; &#x432;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x43f;&#x43e;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435;&#x43c;. &#x414;&#x43b;&#x44f; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x435;&#x433;&#x43e;, &#x432;&#x44b; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44c; &#x441;&#x432;&#x43e;&#x439; &#x43a;&#x43e;&#x434; &#x432; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x44b;&#x445; &#x43c;&#x435;&#x441;&#x442;&#x430;&#x445; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430;, &#x43b;&#x438;&#x431;&#x43e; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43d;&#x430;&#x441;&#x43b;&#x435;&#x434;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43b;&#x438;&#x431;&#x43e; &#x43f;&#x43e;&#x434;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x432; &#x441;&#x432;&#x43e;&#x439; &#x441;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x43a;&#x43b;&#x430;&#x441;&#x441;. &#x41a;&#x43e;&#x434; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430; &#x432;&#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x441;&#x442;&#x432;&#x438;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x432;&#x430;&#x448; &#x43a;&#x43e;&#x434;.</p><p>&#x421;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x442; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x44b;&#x435; &#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x44b; &#x43f;&#x43e;&#x434;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x44c; &#x432;&#x430;&#x448; &#x43a;&#x43e;&#x434; &#x434;&#x43b;&#x44f; &#x435;&#x433;&#x43e; &#x434;&#x430;&#x43b;&#x44c;&#x43d;&#x435;&#x439;&#x448;&#x435;&#x433;&#x43e; &#x432;&#x44b;&#x437;&#x43e;&#x432;&#x430;. &#x412; &#x43f;&#x440;&#x435;&#x434;&#x44b;&#x434;&#x443;&#x449;&#x435;&#x43c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x435; &#x43d;&#x430; ruby, &#x43c;&#x44b; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434; <tt>bind</tt> &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43f;&#x43e;&#x43b;&#x44f;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x435;&#x442; &#x438;&#x43c;&#x44f; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x44f; &#x438; <a class="externalLink" href="http://martinfowler.com/bliki/Closure.html">&#x437;&#x430;&#x43c;&#x44b;&#x43a;&#x430;&#x43d;&#x438;&#x435;</a> &#x432; &#x43a;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x430;&#x440;&#x433;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432;. &#x412;&#x441;&#x44f;&#x43a;&#x438;&#x439; &#x440;&#x430;&#x437;, &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x43e;&#x435; &#x43f;&#x43e;&#x43b;&#x435; &#x443;&#x437;&#x43d;&#x430;&#x435;&#x442; &#x43e; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x438;, &#x43e;&#x43d;&#x43e; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x43d;&#x430;&#x448; &#x43a;&#x43e;&#x434; &#x438;&#x437; &#x437;&#x430;&#x43c;&#x44b;&#x43a;&#x430;&#x43d;&#x438;&#x44f;. &#x418;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x442;&#x430;&#x43a;&#x438;&#x445; &#x437;&#x430;&#x43c;&#x44b;&#x43a;&#x430;&#x43d;&#x438;&#x439; &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x443;&#x434;&#x43e;&#x431;&#x43d;&#x43e;, &#x43d;&#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x435; &#x44f;&#x437;&#x44b;&#x43a;&#x438; &#x43d;&#x435; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44e;&#x442; &#x438;&#x445;.</p><p>&#x415;&#x449;&#x435; &#x43e;&#x434;&#x438;&#x43d; &#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x44d;&#x442;&#x43e; - &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x442;&#x430;&#x43a;, &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x438;&#x43b; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x44f;, &#x430; &#x43a;&#x43e;&#x434; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x430;&#x43b;&#x441;&#x44f; &#x43d;&#x430; &#x44d;&#x442;&#x438; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x44f;. .NET &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x438;&#x43c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x43e;&#x43c; &#x43f;&#x43b;&#x430;&#x442;&#x444;&#x43e;&#x440;&#x43c;&#x44b;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x43b;&#x44e;&#x434;&#x44f;&#x43c; &#x43e;&#x431;&#x44a;&#x44f;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x441;&#x432;&#x43e;&#x438; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x44f; &#x43d;&#x430; &#x432;&#x438;&#x434;&#x436;&#x435;&#x442;&#x44b; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; &#x44f;&#x437;&#x44b;&#x43a;&#x430;. &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x43d;&#x430;&#x437;&#x43d;&#x430;&#x447;&#x438;&#x442;&#x44c; &#x43c;&#x435;&#x442;&#x43e;&#x434; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x44f; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x434;&#x435;&#x43b;&#x435;&#x433;&#x430;&#x442;&#x43e;&#x432;.</p><p>&#x420;&#x430;&#x441;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x432;&#x44b;&#x448;&#x435; &#x43f;&#x43e;&#x434;&#x445;&#x43e;&#x434;&#x44b; (&#x43e;&#x43d;&#x438; &#x43e;&#x434;&#x438;&#x43d;&#x430;&#x43a;&#x43e;&#x432;&#x44b;&#x435;) &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x43e; &#x43f;&#x43e;&#x434;&#x445;&#x43e;&#x434;&#x44f;&#x442; &#x432; &#x435;&#x434;&#x438;&#x43d;&#x438;&#x447;&#x43d;&#x44b;&#x445; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x44f;&#x445;, &#x43d;&#x43e; &#x438;&#x43d;&#x43e;&#x433;&#x434;&#x430; &#x432;&#x430;&#x43c; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x43e;&#x43d;&#x430;&#x434;&#x43e;&#x431;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x43e;&#x431;&#x44a;&#x435;&#x434;&#x438;&#x43d;&#x438;&#x442;&#x44c; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x43a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x432;&#x44b;&#x437;&#x43e;&#x432;&#x43e;&#x432; &#x432; &#x435;&#x434;&#x438;&#x43d;&#x44b;&#x439; &#x431;&#x43b;&#x43e;&#x43a; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x44f;. &#x412; &#x44d;&#x442;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x44c; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x432;&#x430;&#x448; &#x43a;&#x43e;&#x434; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x432;&#x44b;&#x437;&#x43e;&#x432;&#x43e;&#x432;.</p><p>EJB-&#x43a;&#x43e;&#x43c;&#x43f;&#x43e;&#x43d;&#x435;&#x43d;&#x442;&#x44b; &#x44f;&#x432;&#x43b;&#x44f;&#x44e;&#x442;&#x441;&#x44f; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x438;&#x43c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x43e;&#x43c; &#x442;&#x430;&#x43a;&#x43e;&#x433;&#x43e; &#x441;&#x442;&#x438;&#x43b;&#x44f; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;. &#x41f;&#x440;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x435; &#x441;&#x435;&#x441;&#x441;&#x438;&#x43e;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x43e;&#x43d;&#x435;&#x43d;&#x442;&#x430;(session bean), &#x432;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x44b;&#x435; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x44e;&#x442;&#x441;&#x44f; EJB-&#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440;&#x43e;&#x43c; &#x432; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x44b;&#x445; &#x442;&#x43e;&#x447;&#x43a;&#x430;&#x445;/&#x441;&#x43e;&#x441;&#x442;&#x43e;&#x44f;&#x43d;&#x438;&#x44f;&#x445; &#x436;&#x438;&#x437;&#x43d;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x446;&#x438;&#x43a;&#x43b;&#x430;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x443; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; <tt>SessionBean</tt> &#x435;&#x441;&#x442;&#x44c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; <tt>ejbRemove</tt>, <tt>ejbPassivate</tt> (&#x441;&#x43e;&#x445;&#x440;&#x430;&#x43d;&#x435;&#x43d; &#x432;&#x43e; &#x432;&#x442;&#x43e;&#x440;&#x438;&#x447;&#x43d;&#x43e;&#x435; &#x445;&#x440;&#x430;&#x43d;&#x438;&#x43b;&#x438;&#x449;&#x435;) &#x438; <tt>ejbActivate</tt> (&#x432;&#x43e;&#x441;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d; &#x438;&#x437; &#x43f;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x43e;&#x441;&#x442;&#x43e;&#x44f;&#x43d;&#x438;&#x44f;). &#x412;&#x44b; &#x43d;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x432;&#x44b;&#x437;&#x43e;&#x432;&#x43e;&#x43c; &#x44d;&#x442;&#x438;&#x445; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x432;, &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x442;&#x435;&#x43c;, &#x447;&#x442;&#x43e; &#x43e;&#x43d;&#x438; &#x434;&#x435;&#x43b;&#x430;&#x44e;&#x442;. &#x41a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x43d;&#x430;&#x441;, &#x430; &#x43d;&#x435; &#x43c;&#x44b; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x43c; &#x435;&#x433;&#x43e;.</p><p>&#x42d;&#x442;&#x43e; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x44b;&#x435; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x438; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;, &#x43d;&#x43e; &#x432;&#x44b; &#x441;&#x442;&#x43e;&#x43b;&#x43a;&#x43d;&#x435;&#x442;&#x435;&#x441;&#x44c; &#x441; &#x44d;&#x442;&#x438;&#x43c; &#x432; &#x433;&#x43e;&#x440;&#x430;&#x437;&#x434;&#x43e; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x44b;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44f;&#x445;. &#x428;&#x430;&#x431;&#x43b;&#x43e;&#x43d;&#x43d;&#x44b;&#x439; &#x43c;&#x435;&#x442;&#x43e;&#x434; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x438;&#x43c; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x43e;&#x43c;: &#x441;&#x443;&#x43f;&#x435;&#x440;-&#x43a;&#x43b;&#x430;&#x441;&#x441; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x44f;&#x435;&#x442; &#x43f;&#x43e;&#x442;&#x43e;&#x43a; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;, &#x441;&#x443;&#x431;&#x43a;&#x43b;&#x430;&#x441;&#x441;&#x44b; &#x43d;&#x430;&#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x43e;&#x442; &#x43d;&#x435;&#x433;&#x43e; &#x43f;&#x435;&#x440;&#x435;&#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x44f;&#x44f; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; &#x438;&#x43b;&#x438; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x443;&#x44f; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x44b;&#x435; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x432; JUnit, &#x43a;&#x43e;&#x434; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; <tt>setUp</tt> &#x438; <tt>tearDown</tt> &#x434;&#x43b;&#x44f; &#x432;&#x430;&#x441;, &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x438; &#x43e;&#x447;&#x438;&#x449;&#x430;&#x442;&#x44c; &#x432;&#x430;&#x448; &#x442;&#x435;&#x441;&#x442;. &#x41f;&#x440;&#x43e;&#x438;&#x441;&#x445;&#x43e;&#x434;&#x438;&#x442; &#x432;&#x44b;&#x437;&#x43e;&#x432;, &#x432;&#x430;&#x448; &#x43a;&#x43e;&#x434; &#x440;&#x435;&#x430;&#x433;&#x438;&#x440;&#x443;&#x435;&#x442; - &#x44d;&#x442;&#x43e; &#x441;&#x43d;&#x43e;&#x432;&#x430; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;.</p><p>&#x412; &#x43d;&#x430;&#x448;&#x438; &#x434;&#x43d;&#x438;, &#x432; &#x441;&#x432;&#x44f;&#x437;&#x438; &#x441; &#x440;&#x43e;&#x441;&#x442;&#x43e;&#x43c; &#x43a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; IoC-&#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440;&#x43e;&#x432;, &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x43f;&#x443;&#x442;&#x430;&#x43d;&#x438;&#x446;&#x430; &#x441;&#x43e; &#x441;&#x43c;&#x44b;&#x441;&#x43b;&#x43e;&#x43c; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;. &#x41d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x43b;&#x44e;&#x434;&#x438; &#x43f;&#x443;&#x442;&#x430;&#x44e;&#x442; &#x43e;&#x431;&#x449;&#x438;&#x439; &#x43f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f; &#x441; &#x43a;&#x43e;&#x43d;&#x43a;&#x440;&#x435;&#x442;&#x43d;&#x44b;&#x43c;&#x438; &#x441;&#x442;&#x438;&#x43b;&#x44f;&#x43c;&#x438; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; (&#x442;&#x430;&#x43a;&#x438;&#x43c;&#x438; &#x43a;&#x430;&#x43a; <a class="externalLink" href="http://martinfowler.com/articles/injection.html"> &#x432;&#x43d;&#x435;&#x434;&#x440;&#x435;&#x43d;&#x438;&#x435; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x435;&#x439;</a>), &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x44d;&#x442;&#x438; &#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440;&#x44b; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;. &#x41d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43d;&#x435;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x437;&#x430;&#x43f;&#x443;&#x442;&#x430;&#x43d;&#x43d;&#x43e; (&#x438; &#x438;&#x440;&#x43e;&#x43d;&#x438;&#x447;&#x43d;&#x43e;), &#x442;&#x430;&#x43a; &#x43a;&#x430;&#x43a; IoC-&#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440;&#x44b;, &#x43a;&#x430;&#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x43e;, &#x440;&#x430;&#x441;&#x441;&#x43c;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x43a;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43a;&#x43e;&#x43d;&#x43a;&#x443;&#x440;&#x435;&#x43d;&#x442;&#x430; EJB, &#x43d;&#x43e; EJB &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44e; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;.</p><p><b>&#x42d;&#x442;&#x438;&#x43c;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f;</b>: &#x41d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x44f; &#x43c;&#x43e;&#x433;&#x443; &#x441;&#x443;&#x434;&#x438;&#x442;&#x44c;, &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d; &#x438;&#x43d;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x432;&#x43f;&#x435;&#x440;&#x432;&#x44b;&#x435; &#x43f;&#x43e;&#x44f;&#x432;&#x438;&#x43b;&#x441;&#x44f; &#x43d;&#x430; &#x441;&#x432;&#x435;&#x442; &#x432; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x435; &#x414;&#x436;&#x43e;&#x43d;&#x441;&#x43e;&#x43d;&#x430; &#x438; &#x424;&#x443;&#x442;&#x430; <a class="externalLink" href="http://www.laputan.org/drc/drc.html">Designing Reusable Classes</a>, &#x43e;&#x43f;&#x443;&#x431;&#x43b;&#x438;&#x43a;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x432; &#x436;&#x443;&#x440;&#x43d;&#x430;&#x43b;&#x435; Object-Oriented Programming &#x432; 1988 &#x433;&#x43e;&#x434;&#x443;. &#x420;&#x430;&#x431;&#x43e;&#x442;&#x430; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x43e;&#x434;&#x43d;&#x43e;&#x439; &#x438;&#x437; &#x442;&#x435;&#x445;, &#x447;&#x442;&#x43e; &#x432; &#x432;&#x43e;&#x437;&#x440;&#x430;&#x441;&#x442;&#x435; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x438; - &#x435;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x43e;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44c; &#x434;&#x430;&#x436;&#x435; &#x441;&#x43f;&#x443;&#x441;&#x442;&#x44f; &#x43f;&#x44f;&#x442;&#x43d;&#x430;&#x434;&#x446;&#x430;&#x442;&#x44c; &#x43b;&#x435;&#x442;. &#x41e;&#x43d;&#x438; &#x441;&#x447;&#x438;&#x442;&#x430;&#x44e;&#x442;, &#x447;&#x442;&#x43e; &#x43e;&#x43d;&#x438; &#x432;&#x437;&#x44f;&#x43b;&#x438; &#x44d;&#x442;&#x43e;&#x442; &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d; &#x43e;&#x442;&#x43a;&#x443;&#x434;&#x430;-&#x442;&#x43e; &#x435;&#x449;&#x435;, &#x43d;&#x43e; &#x43d;&#x435; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x432;&#x441;&#x43f;&#x43e;&#x43c;&#x43d;&#x438;&#x442;&#x44c; &#x43e;&#x442;&#x43a;&#x443;&#x434;&#x430;. &#x417;&#x430;&#x442;&#x435;&#x43c; &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d; &#x432;&#x442;&#x435;&#x440;&#x441;&#x44f; &#x432; &#x43e;&#x431;&#x44a;&#x435;&#x43a;&#x442;&#x43d;&#x43e;-&#x43e;&#x440;&#x438;&#x435;&#x43d;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x435; &#x441;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x438; &#x432;&#x43d;&#x43e;&#x432;&#x44c; &#x43f;&#x43e;&#x44f;&#x432;&#x438;&#x43b;&#x441;&#x44f; &#x432; &#x43a;&#x43d;&#x438;&#x433;&#x435; Gang of Four. &#x411;&#x43e;&#x43b;&#x435;&#x435; &#x43a;&#x440;&#x430;&#x441;&#x438;&#x432;&#x44b;&#x439; &#x441;&#x438;&#x43d;&#x43e;&#x43d;&#x438;&#x43c; &quot;&#x41f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f; &#x413;&#x43e;&#x43b;&#x43b;&#x438;&#x432;&#x443;&#x434;&#x430;&quot;, &#x43a;&#x430;&#x436;&#x435;&#x442;&#x441;&#x44f;, &#x431;&#x435;&#x440;&#x435;&#x442; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x43e; &#x432; <a class="externalLink" href="http://www.digibarn.com/friends/curbow/star/XDEPaper.pdf"> &#x440;&#x430;&#x431;&#x43e;&#x442;&#x435; &#x420;&#x438;&#x447;&#x430;&#x440;&#x434;&#x430; &#x421;&#x432;&#x438;&#x442;&#x430;</a> &#x432; Mesa &#x432; 1983 &#x433;&#x43e;&#x434;&#x443;. &#x412; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x435; &#x446;&#x435;&#x43b;&#x435;&#x439; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438; &#x43e;&#x43d; &#x43f;&#x438;&#x448;&#x435;&#x442;: <i>&#x41d;&#x435; &#x437;&#x432;&#x43e;&#x43d;&#x438; &#x43d;&#x430;&#x43c;, &#x43c;&#x44b; &#x441;&#x430;&#x43c;&#x438; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43d;&#x438;&#x43c; &#x442;&#x435;&#x431;&#x435; (&#x417;&#x430;&#x43a;&#x43e;&#x43d; &#x413;&#x43e;&#x43b;&#x43b;&#x438;&#x432;&#x443;&#x434;&#x430;): &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x43e;&#x440;&#x433;&#x430;&#x43d;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x422;&#x430;&#x445;&#x43e;, &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x43f;&#x440;&#x435;&#x434;&#x443;&#x43f;&#x440;&#x435;&#x434;&#x438;&#x442;&#x44c; &#x435;&#x433;&#x43e;, &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c; &#x437;&#x430;&#x445;&#x43e;&#x447;&#x435;&#x442; &#x43f;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44c; &#x43a;&#x430;&#x43a;&#x43e;&#x435;-&#x442;&#x43e; &#x441;&#x43e;&#x431;&#x44b;&#x442;&#x438;&#x435; &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x443;, &#x432;&#x43c;&#x435;&#x441;&#x442;&#x43e; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x442;&#x44c; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &quot;&#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441;&#x438;&#x442;&#x44c; &#x443; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x443; &#x438; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x44c; &#x435;&#x435;&quot;</i>. &#x414;&#x436;&#x43e;&#x43d; &#x412;&#x43b;&#x438;&#x441;&#x441;&#x438;&#x434;&#x435;&#x441; &#x43f;&#x438;&#x448;&#x435;&#x442; <a class="externalLink" href="http://www.research.ibm.com/designpatterns/pubs/ph-feb96.txt"> &#x43a;&#x43e;&#x43b;&#x43e;&#x43d;&#x43a;&#x443; &#x43e; C++</a>, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x43d;&#x435;&#x441;&#x435;&#x442; &#x432; &#x441;&#x435;&#x431;&#x435; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x435;&#x435; &#x43e;&#x431;&#x44a;&#x44f;&#x441;&#x43d;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43d;&#x446;&#x435;&#x43f;&#x446;&#x438;&#x438; &#x43f;&#x43e;&#x434; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &quot;&#x41f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f; &#x413;&#x43e;&#x43b;&#x43b;&#x438;&#x432;&#x443;&#x434;&#x430;&quot;. (&#x421;&#x43f;&#x430;&#x441;&#x438;&#x431;&#x43e; &#x411;&#x440;&#x430;&#x439;&#x430;&#x43d;&#x443; &#x424;&#x443;&#x442;&#x443; and &#x420;&#x430;&#x43b;&#x44c;&#x444;&#x443; &#x414;&#x436;&#x43e;&#x43d;&#x441;&#x43e;&#x43d;&#x443; &#x437;&#x430; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c; &#x441; &#x44d;&#x442;&#x438;&#x43c;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x435;&#x439;).</p></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                    2011
                        <a href="http://sody.github.com/">sody</a>.
            All Rights Reserved.      
                
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
