<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!-- Generated by Apache Maven Doxia at 04.05.2011 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ru" lang="ru">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Sody's Site - Использование SPI механизма</title>
    <style type="text/css" media="all">
      @import url("./css/maven-base.css");
      @import url("./css/maven-theme.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
      <meta name="author" content="sody" />
    <meta name="Date-Creation-yyyymmdd" content="20110429" />
    <meta name="Date-Revision-yyyymmdd" content="20110504" />
    <meta http-equiv="Content-Language" content="ru" />
        

          <!-- Google Analytics -->
    <script type="text/javascript">
    
      var _gaq = _gaq || [];
      _gaq.push(['_setAccount', 'UA-23122478-1']);
      _gaq.push(['_trackPageview']);

      (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
      })();

    </script>
    </head>
  <body class="composite">
    <div id="banner">
                    <div id="bannerLeft">
                Sody's Site
                </div>
                    <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
            
                
                <div class="xleft">
        <span id="publishDate">Last Published: 2011-05-04</span>
                  &nbsp;| <span id="projectVersion">Version: 1.0-SNAPSHOT</span>
                      </div>
            <div class="xright">                    <a href="../index.html" title="English">English</a>
            |
                        <a href="index.html" title="Русский">Русский</a>
              
                
      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
             
                
                                <h5>Статьи</h5>
                  <ul>
                  <li class="none">
                          <a href="site.html" title="Создание сайта средствами мавена">Создание сайта средствами мавена</a>
            </li>
                  <li class="none">
            <strong>Использование SPI механизма</strong>
          </li>
          </ul>
                       <h5>Переводы</h5>
                  <ul>
                  <li class="none">
                          <a href="ioc.html" title="Инверсия управления">Инверсия управления</a>
            </li>
                  <li class="none">
                          <a href="injection.html" title="Внедрение зависимостей">Внедрение зависимостей</a>
            </li>
                  <li class="none">
                          <a href="performance.html" title="Лучшие способы ускорить сайт">Лучшие способы ускорить сайт</a>
            </li>
          </ul>
                       <h5>Проекты</h5>
                  <ul>
                  <li class="none">
                          <a href="../greatage/ru/index.html" title="Great Age">Great Age</a>
            </li>
          </ul>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                
            </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
        <div class="section"><h2>&#x418;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; SPI &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c;&#x430; &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x439;<a name="a_SPI____"></a></h2><p>&#x410;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43a;&#x442;&#x443;&#x440;&#x430; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x430; Java(&#x438; &#x43d;&#x435; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e;) &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x439; &#x441;&#x435;&#x433;&#x43e;&#x434;&#x43d;&#x44f; &#x43f;&#x440;&#x435;&#x434;&#x443;&#x441;&#x43c;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x435;&#x442; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x430; &#x43f;&#x43e;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x43e;&#x43c; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x440;&#x43e;&#x434;&#x430; &#x43c;&#x430;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x445; &#x432;&#x43e;&#x437;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439; &#x43d;&#x430; &#x43a;&#x43e;&#x434;. &#x412; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x44d;&#x442;&#x43e; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x441;&#x442;&#x430;&#x43b;&#x43e; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;, &#x435;&#x441;&#x43b;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43a;&#x430;&#x43a;&#x43e;&#x439;-&#x43d;&#x438;&#x431;&#x443;&#x434;&#x44c; &#x43c;&#x43e;&#x434;&#x43d;&#x44b;&#x439; <a class="externalLink" href="http://habrahabr.ru/blogs/complete_code/116232/">&#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a; &#x438;&#x43b;&#x438; IoC-&#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440;</a>. &#x41d;&#x43e; &#x447;&#x442;&#x43e; &#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c;, &#x435;&#x441;&#x43b;&#x438; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x434;&#x43e;&#x43b;&#x433;&#x43e;&#x436;&#x438;&#x432;&#x443;&#x449;&#x435;&#x435; &#x438; &#x441;&#x43b;&#x438;&#x448;&#x43a;&#x43e;&#x43c; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x435; &#x434;&#x43b;&#x44f; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x43f;&#x435;&#x440;&#x435;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x43d;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43a;&#x430;&#x43a;&#x43e;&#x433;&#x43e; &#x43b;&#x438;&#x431;&#x43e; &#x444;&#x440;&#x435;&#x439;&#x43c;&#x432;&#x43e;&#x440;&#x43a;&#x430;?</p><p>&#x412; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x43c; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x438;, &#x441; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x43c; &#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x43b;, &#x431;&#x44b;&#x43b; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x43d; &#x43d;&#x430; &#x442;&#x43e;&#x442; &#x43c;&#x43e;&#x43c;&#x435;&#x43d;&#x442; &#x43d;&#x435;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x439; &#x43c;&#x43d;&#x435; &#x432;&#x435;&#x43b;&#x43e;&#x441;&#x438;&#x43f;&#x435;&#x434;(SPI &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c;), &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x438;&#x441;&#x43a;&#x430;&#x43b; &#x432; &#x434;&#x436;&#x430;&#x440;&#x43a;&#x430;&#x445; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x44b;&#x435; &#x444;&#x430;&#x439;&#x43b;&#x44b; &#x432;&#x438;&#x434;&#x430; <tt>META-INF/services/&lt;qualified interface name&gt;</tt> &#x438; &#x431;&#x440;&#x430;&#x43b; &#x43e;&#x442;&#x442;&#x443;&#x434;&#x430; &#x43d;&#x430;&#x437;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43d;&#x443;&#x436;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x430;, &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x443;&#x44e;&#x449;&#x435;&#x433;&#x43e; &#x44d;&#x442;&#x43e;&#x442; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;, &#x434;&#x430;&#x43b;&#x435;&#x435; &#x44d;&#x442;&#x43e;&#x442; &#x43a;&#x43b;&#x430;&#x441;&#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43b;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x435;. &#x41f;&#x43e;&#x438;&#x441;&#x43a;&#x430;&#x432; &#x432; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442;&#x435;, &#x443;&#x437;&#x43d;&#x430;&#x43b;, &#x447;&#x442;&#x43e; <a class="externalLink" href="http://en.wikipedia.org/wiki/Service_provider_interface">Service Provider Interface(SPI)</a> &#x43f;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x435;&#x442; &#x441;&#x43e;&#x431;&#x43e;&#x439; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x44b;&#x439; &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c; &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43a;&#x438; &#x441;&#x43c;&#x435;&#x43d;&#x43d;&#x44b;&#x445; &#x43a;&#x43e;&#x43c;&#x43f;&#x43e;&#x43d;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x438; &#x447;&#x442;&#x43e; &#x44d;&#x442;&#x43e;&#x442; &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c; &#x443;&#x436;&#x435; &#x434;&#x43e;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x430;&#x432;&#x43d;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x432; <a class="externalLink" href="http://en.wikipedia.org/wiki/Java_Runtime_Environment">Java Runtime Environment(JRE)</a>, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x432; <a class="externalLink" href="http://en.wikipedia.org/wiki/Java_Database_Connectivity">Java Database Connectivity(JDBC)</a>:</p><div class="source"><pre>ps = Service.providers(java.sql.Driver.class);
try {
  while (ps.hasNext()) {
    ps.next();
  }
} catch (Throwable t) {
  // Do nothing
}
</pre></div><p>&#x411;&#x43b;&#x430;&#x433;&#x43e;&#x434;&#x430;&#x440;&#x44f; &#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x43a;&#x43e;&#x434;&#x443; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435; &#x43d;&#x435; &#x43d;&#x443;&#x436;&#x434;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x43a;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43a;&#x446;&#x438;&#x438; <tt>Class.forName(&lt;driver class&gt;)</tt> (&#x445;&#x43e;&#x442;&#x44f; &#x438; &#x441; &#x43d;&#x435;&#x439; &#x431;&#x443;&#x434;&#x443;&#x442; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c;), JDBC &#x434;&#x440;&#x430;&#x439;&#x432;&#x435;&#x440;&#x44b; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43f;&#x43e;&#x434;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x44b; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x43f;&#x440;&#x438; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x43c; &#x43e;&#x431;&#x440;&#x430;&#x449;&#x435;&#x43d;&#x438;&#x438; &#x43a; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x430;&#x43c; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x430; <tt>DriverManager</tt>.</p><p>SPI &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x432; <a class="externalLink" href="http://en.wikipedia.org/wiki/Java_Cryptography_Extension">Java Cryptography Extension(JCE)</a>, <a class="externalLink" href="http://en.wikipedia.org/wiki/Java_Naming_and_Directory_Interface">Java Naming and Directory Service(JNDI)</a>, <a class="externalLink" href="http://en.wikipedia.org/wiki/Java_API_for_XML_Processing">Java API for XML Processing(JAXP)</a>, <a class="externalLink" href="http://en.wikipedia.org/wiki/Java_Business_Integration">Java Business Integration(JBI)</a>, Java Sound, Java Image I/O.</p></div><div class="section"><h2>&#x41a;&#x430;&#x43a; &#x44d;&#x442;&#x43e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442;?<a name="a__"></a></h2><p>&#x412;&#x435;&#x441;&#x44c; &#x441;&#x43c;&#x44b;&#x441;&#x43b; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x438; &#x43b;&#x43e;&#x433;&#x438;&#x43a;&#x438; &#x43d;&#x430; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;(Service) &#x438; &#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x44b;(Service Providers). &#x421;&#x441;&#x44b;&#x43b;&#x43a;&#x438; &#x43d;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x44b; &#x441;&#x43e;&#x445;&#x440;&#x430;&#x43d;&#x44f;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x434;&#x436;&#x430;&#x440;&#x43a;&#x430;&#x445; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x439; &#x432; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x43e;&#x43c; &#x444;&#x430;&#x439;&#x43b;&#x435;(UTF-8) <tt>META-INF/services/&lt;qualified service class&gt;</tt>, &#x432; &#x43a;&#x430;&#x436;&#x434;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x435; &#x43f;&#x43e;&#x43b;&#x43d;&#x43e;&#x435; &#x438;&#x43c;&#x44f; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x430;. &#x41f;&#x443;&#x441;&#x442;&#x44b;&#x435; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; &#x438; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x440;&#x438;&#x438;(&#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x44e;&#x449;&#x438;&#x435;&#x441;&#x44f; &#x441; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x430; #) &#x438;&#x433;&#x43d;&#x43e;&#x440;&#x438;&#x440;&#x443;&#x44e;&#x442;&#x441;&#x44f;. &#x41e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x43d;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x44b;: &#x43e;&#x43d;&#x438; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x43b;&#x438;&#x431;&#x43e; &#x43d;&#x430;&#x441;&#x43b;&#x435;&#x434;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x43e;&#x442; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x430; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x430; &#x438; &#x438;&#x43c;&#x435;&#x442;&#x44c; &#x43a;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43a;&#x442;&#x43e;&#x440; &#x43f;&#x43e; &#x443;&#x43c;&#x43e;&#x43b;&#x447;&#x430;&#x43d;&#x438;&#x44e;(zero-argument public constructor).</p><p>&#x41e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x43e;&#x432; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x432;&#x43e;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x432;&#x445;&#x43e;&#x434;&#x44f;&#x449;&#x435;&#x439; &#x432; &#x441;&#x43e;&#x441;&#x442;&#x430;&#x432; Java SE 6 API &#x443;&#x442;&#x438;&#x43b;&#x438;&#x442;&#x43e;&#x439; <tt>java.util.ServiceLoader</tt>, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x43f;&#x43e; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x435;&#x43c;&#x443; &#x43f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f;&#x443;:</p><img src="../images/service_loader.gif" alt="" /><p>&#x41f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x438;&#x439; &#x43a;&#x43e;&#x434; &#x437;&#x430;&#x43f;&#x440;&#x430;&#x448;&#x438;&#x432;&#x430;&#x435;&#x442; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43a; &#x43a;&#x43e;&#x43d;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x434;&#x43b;&#x44f; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x430;, &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43a; &#x43f;&#x43e; &#x43c;&#x435;&#x440;&#x435; &#x43d;&#x430;&#x434;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x435;&#x442; &#x438;&#x437; &#x43a;&#x43e;&#x43d;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x44b; &#x438; &#x441;&#x43e;&#x445;&#x440;&#x430;&#x43d;&#x44f;&#x435;&#x442; &#x438;&#x445; &#x432; &#x43a;&#x44d;&#x448;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44c; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x43e;&#x447;&#x438;&#x441;&#x442;&#x438;&#x442;&#x44c; &#x43a;&#x44d;&#x448; &#x438; &#x437;&#x430;&#x43d;&#x43e;&#x432;&#x43e; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44c; &#x43a;&#x43e;&#x43d;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x44e;.</p><p>&#x412; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x440;&#x430;&#x43d;&#x43d;&#x438;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f;&#x445; Java SE &#x435;&#x441;&#x442;&#x44c; &#x430;&#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x438;&#x447;&#x43d;&#x430;&#x44f; &#x443;&#x442;&#x438;&#x43b;&#x438;&#x442;&#x430; <tt>sun.misc.Service</tt>, &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x43f;&#x43e; &#x442;&#x43e;&#x43c;&#x443; &#x436;&#x435; &#x43f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f;&#x443;, &#x43d;&#x43e; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x447;&#x430;&#x441;&#x442;&#x44c;&#x44e; &#x43f;&#x440;&#x43e;&#x43f;&#x440;&#x438;&#x435;&#x442;&#x430;&#x440;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e; Sun(Oracle) &#x438; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x443;&#x434;&#x430;&#x43b;&#x435;&#x43d;&#x430; &#x432; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x440;&#x435;&#x43b;&#x438;&#x437;&#x430;&#x445; Java SE.</p></div><div class="section"><h2>&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;<a name="a_"></a></h2><p>&#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x443; &#x43d;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44c; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x430;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x438;&#x449;&#x435;&#x442; &#x43c;&#x443;&#x437;&#x44b;&#x43a;&#x443; &#x43d;&#x430; &#x43a;&#x43e;&#x43c;&#x43f;&#x435; &#x438; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x442; &#x43e;&#x442;&#x441;&#x43e;&#x440;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x43f;&#x43e; &#x438;&#x43c;&#x435;&#x43d;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442; &#x43d;&#x430; &#x44d;&#x43a;&#x440;&#x430;&#x43d;.</p><div class="source"><pre>public class MusicFinder {

  public static List&lt;String&gt; getMusic() {
    //some code
  }
}

public class ReportRenderer {

  public void generateReport() {
    final List&lt;String&gt; music = findMusic();
    for (String composition : music) {
      System.out.println(composition);
    }
  }

  public List&lt;String&gt; findMusic() {
    final List&lt;String&gt; music = MusicFinder.getMusic();
    Collections.sort(music);
    return music;
  }

  public static ReportRenderer getInstance() {
    return new ReportRenderer();
  }

  public static void main(final String[] args) {
    final ReportRenderer renderer = ReportRenderer.getInstance();
    renderer.generateReport();
  }
}
</pre></div><p>&#x412; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x43c;&#x43e;&#x43c;&#x435;&#x43d;&#x442; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43c;&#x44b; &#x43e;&#x441;&#x43e;&#x437;&#x43d;&#x430;&#x43b;&#x438; &#x432;&#x441;&#x44e; &#x437;&#x43d;&#x430;&#x447;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x44d;&#x442;&#x43e;&#x439; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x44b; &#x434;&#x43b;&#x44f; &#x43e;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x438; &#x440;&#x435;&#x448;&#x438;&#x43b;&#x438; &#x43f;&#x43e;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x435;&#x439; &#x441;&#x43e; &#x441;&#x432;&#x43e;&#x438;&#x43c;&#x438; &#x434;&#x440;&#x443;&#x437;&#x44c;&#x44f;&#x43c;&#x438;. &#x414;&#x440;&#x443;&#x437;&#x44c;&#x44f; &#x43f;&#x43e;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43b;&#x438;&#x441;&#x44c; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x43e;&#x43c; &#x438; &#x440;&#x435;&#x448;&#x438;&#x43b;&#x438;, &#x447;&#x442;&#x43e; &#x447;&#x435;&#x433;&#x43e;-&#x442;&#x43e; &#x43d;&#x435; &#x445;&#x432;&#x430;&#x442;&#x430;&#x435;&#x442;. &#x41c;&#x43e;&#x436;&#x435;&#x442; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x432; &#x43e;&#x442;&#x434;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x444;&#x430;&#x439;&#x43b;? &#x41d;&#x43e; &#x442;&#x43e;&#x433;&#x434;&#x430; &#x43f;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44f; &#x43f;&#x435;&#x440;&#x435;&#x43f;&#x438;&#x441;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x432;&#x435;&#x441;&#x44c; &#x44d;&#x442;&#x43e;&#x442; &#x43a;&#x43b;&#x435;&#x432;&#x44b;&#x439; &#x43a;&#x43e;&#x434;. &#x41d;&#x435; &#x43f;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44f;, &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x432;&#x43e;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; SPI &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c;&#x43e;&#x43c;.</p><p>&#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x441;&#x43e;&#x437;&#x434;&#x430;&#x434;&#x438;&#x43c; &#x43f;&#x43b;&#x430;&#x433;&#x438;&#x43d; &#x434;&#x43b;&#x44f; &#x43d;&#x430;&#x448;&#x435;&#x439; &#x441;&#x443;&#x43f;&#x435;&#x440;-&#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x44b;:</p><div class="source"><pre>public class FileReportRenderer extends ReportRenderer {

  @Override
  public void generateReport() {
    final List&lt;String&gt; music = findMusic();
    try {
      final FileWriter writer = new FileWriter(&quot;music.txt&quot;);
      for (String composition : music) {
        writer.append(composition);
        writer.append(&quot;\n&quot;);
      }
      writer.flush();
    } catch (IOException e) {
      e.printStackTrace();
    }
  }
}
</pre></div><p>&#x41f;&#x43e;&#x43c;&#x435;&#x441;&#x442;&#x438;&#x43c; &#x432; <tt>META-INF/services/com.example.ReportRenderer</tt> &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x435;&#x435;:</p><div><pre>com.example.FileReportRenderer
</pre></div><p>&#x421;&#x434;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x443;&#x44e; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x443; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44f;&#x435;&#x43c;&#x43e;&#x439;:</p><div class="source"><pre>public class ReportRenderer {
  //...

  public static ReportRenderer getInstance() {
    final Iterator&lt;ReportRenderer&gt; providers = ServiceLoader.load(ReportRenderer.class).iterator();
    if (providers.hasNext()) {
      return providers.next();
    }

    return new ReportRenderer();
  }

  //...
}
</pre></div><p>&#x41f;&#x440;&#x438; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;, &#x43a;&#x430;&#x43a; &#x438; &#x43f;&#x440;&#x435;&#x436;&#x434;&#x435;, &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x432;&#x441;&#x44e; &#x43d;&#x430;&#x439;&#x434;&#x435;&#x43d;&#x43d;&#x443;&#x44e; &#x43c;&#x443;&#x437;&#x44b;&#x43a;&#x443; &#x43d;&#x430; &#x44d;&#x43a;&#x440;&#x430;&#x43d;. &#x41d;&#x43e; &#x435;&#x441;&#x43b;&#x438; &#x43c;&#x44b; &#x43f;&#x43e;&#x43c;&#x435;&#x441;&#x442;&#x438;&#x43c; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x447;&#x442;&#x43e; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x43d;&#x443;&#x44e; &#x434;&#x436;&#x430;&#x440;&#x43a;&#x443; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x432; classpath, &#x442;&#x43e; &#x43c;&#x44b; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x438;&#x43c; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x435; &#x444;&#x430;&#x439;&#x43b;&#x438;&#x43a; <tt>music.txt</tt>, &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x44b; &#x43f;&#x43e;&#x438;&#x441;&#x43a;&#x430;.</p><p>&#x422;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x43f;&#x440;&#x438;&#x448;&#x43b;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x43f;&#x43e;&#x438;&#x433;&#x440;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x441; <tt>MusicFinder</tt>-&#x43e;&#x43c;. &#x421;&#x434;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x435;&#x433;&#x43e; &#x442;&#x43e;&#x436;&#x435; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44f;&#x435;&#x43c;&#x44b;&#x43c;. &#x414;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x43f;&#x43e;&#x43c;&#x435;&#x43d;&#x44f;&#x435;&#x43c; &#x43a;&#x43b;&#x430;&#x441;&#x441; &#x43d;&#x430; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;:</p><div class="source"><pre>public interface MusicFinder {

  List&lt;String&gt; getMusic();
}
</pre></div><p>&#x414;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x43c; &#x432; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x43c; &#x43c;&#x43e;&#x434;&#x443;&#x43b;&#x435; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e;:</p><div class="source"><pre>public class DummyMusicFinder implements MusicFinder {
  public List&lt;String&gt; getMusic() {
    return Collections.singletonList(&quot;From DummyMusicFinder...&quot;);
  }
}
</pre></div><p>&#x41f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43a;&#x430; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x439; &#x432; <tt>ReportRenderer</tt>:</p><div class="source"><pre>public class ReportRenderer {
  //...

  public List&lt;String&gt; findMusic() {
    final List&lt;String&gt; music = new ArrayList&lt;String&gt;();
    for (final MusicFinder finder : ServiceLoader.load(MusicFinder.class)) {
      music.addAll(finder.getMusic());
    }
    Collections.sort(music);
    return music;
  }

  //...
}
</pre></div><p>&#x41a;&#x430;&#x43a; &#x438; &#x432; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x441; <tt>ReportRenderer</tt> &#x434;&#x43e;&#x431;&#x430;&#x432;&#x438;&#x43c; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x44b;&#x439; &#x444;&#x430;&#x439;&#x43b; <tt>META-INF/services/com.example.MusicFinder</tt>, &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x438;&#x439;:</p><div class="source"><pre>com.example.DummyMusicFinder
</pre></div><p>&#x41e;&#x43f;&#x44f;&#x442;&#x44c; &#x436;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x439; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x44b; &#x43d;&#x435; &#x43f;&#x43e;&#x43c;&#x435;&#x43d;&#x44f;&#x43b;&#x441;&#x44f;. &#x422;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x435;. &#x417;&#x434;&#x435;&#x441;&#x44c; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x434;&#x432;&#x435; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; <tt>MusicFinder</tt>-&#x430;:</p><div class="source"><pre>public class ExtendedMusicFinder implements MusicFinder {
  public List&lt;String&gt; getMusic() {
    return Collections.singletonList(&quot;From ExtendedMusicFinder...&quot;);
  }
}

public class MyMusicFinder implements MusicFinder {
  public List&lt;String&gt; getMusic() {
    return Collections.singletonList(&quot;From MyMusicFinder...&quot;);
  }
}
</pre></div><p><tt>META-INF/service/com.example.MusicFinder</tt>:</p><div><pre>com.example.MyMusicFinder
com.example.ExtendedMusicFinder
</pre></div><p>&#x41d;&#x443;, &#x432;&#x43e;&#x442; &#x438; &#x432;&#x441;&#x435;, &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x430; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44e;&#x449;&#x430;&#x44f; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x433;&#x43e;&#x442;&#x43e;&#x432;&#x430;, &#x442;&#x435;&#x43f;&#x435;&#x440;&#x44c; &#x441; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x432; classpath, &#x43e;&#x43d;&#x430; &#x432;&#x44b;&#x434;&#x430;&#x441;&#x442; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a;:</p><div><pre>From DummyMusicFinder...
From ExtendedMusicFinder...
From MyMusicFinder...
</pre></div><p>&#x418;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x438;&#x43a;&#x438; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x430; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43d;&#x430;&#x439;&#x442;&#x438; &#x437;&#x434;&#x435;&#x441;&#x44c;.</p></div><div class="section"><h2>&#x417;&#x430;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x438;&#x435;<a name="a"></a></h2><p>&#x41f;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x434;&#x430;&#x43b;&#x435;&#x43a; &#x43e;&#x442; &#x441;&#x43e;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43d;&#x441;&#x442;&#x432;&#x430;, &#x438; &#x44f; &#x43d;&#x435; &#x43f;&#x440;&#x435;&#x442;&#x435;&#x43d;&#x434;&#x443;&#x44e; &#x43d;&#x430; &#x430;&#x432;&#x442;&#x43e;&#x440;&#x430; &#x441;&#x430;&#x43c;&#x43e;&#x439; &#x43a;&#x440;&#x443;&#x442;&#x43e;&#x433;&#x43e; &#x432; &#x43c;&#x438;&#x440;&#x435; &#x43f;&#x43e;&#x438;&#x441;&#x43a;&#x43e;&#x432;&#x438;&#x43a;&#x430; &#x43c;&#x443;&#x437;&#x44b;&#x43a;&#x438;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x44f; &#x43d;&#x435; &#x43f;&#x440;&#x438;&#x437;&#x44b;&#x432;&#x430;&#x44e; &#x43a; &#x444;&#x430;&#x43d;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x43c;&#x443; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44e; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x43c;&#x435;&#x445;&#x430;&#x43d;&#x438;&#x437;&#x43c;&#x430;, &#x442;&#x430;&#x43a; &#x43a;&#x430;&#x43a; &#x43d;&#x435; &#x432;&#x435;&#x437;&#x434;&#x435; &#x43e;&#x43d; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x43d;&#x438;&#x43c;, &#x434;&#x430; &#x438; &#x441;&#x447;&#x438;&#x442;&#x430;&#x44e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; IoC-&#x43a;&#x43e;&#x43d;&#x442;&#x435;&#x439;&#x43d;&#x435;&#x440;&#x430; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x43a;&#x440;&#x430;&#x441;&#x438;&#x432;&#x44b;&#x43c; &#x440;&#x435;&#x448;&#x435;&#x43d;&#x438;&#x435;&#x43c;, &#x43d;&#x43e; &#x432;&#x441;&#x435; &#x436;&#x435; &#x43a;&#x43e;&#x435;-&#x433;&#x434;&#x435; &#x438; &#x43a;&#x43e;&#x435;-&#x43a;&#x43e;&#x43c;&#x443; &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x43f;&#x43e;&#x434;&#x445;&#x43e;&#x434; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43e;&#x43a;&#x430;&#x437;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x43d;&#x44b;&#x43c;. &#x421;&#x43f;&#x430;&#x441;&#x438;&#x431;&#x43e; &#x437;&#x430; &#x443;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x43e;&#x435; &#x43d;&#x430; &#x43f;&#x440;&#x43e;&#x447;&#x442;&#x435;&#x43d;&#x438;&#x435; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x438; &#x432;&#x440;&#x435;&#x43c;&#x44f;.</p></div><div class="section"><h2>&#x41b;&#x438;&#x442;&#x435;&#x440;&#x430;&#x442;&#x443;&#x440;&#x430;<a name="a"></a></h2><ul><li><a class="externalLink" href="http://ru.wikipedia.org/wiki/Плагин">&#x41f;&#x43b;&#x430;&#x433;&#x438;&#x43d;</a></li><li><a class="externalLink" href="http://en.wikipedia.org/wiki/Service_provider_interface">Service Provider Interface</a></li><li><a class="externalLink" href="http://download.oracle.com/javase/1.3/docs/guide/jar/jar.html#Service Provider">Service Provider</a></li><li><a class="externalLink" href="http://www.developer.com/java/article.php/3848881/Service-Provider-Interface-Creating-Extensible-Java-Applications.htm">Service Provider Interface: Creating Extensible Java Applications</a></li><li><a class="externalLink" href="http://download.oracle.com/javase/6/docs/api/java/util/ServiceLoader.html">Service Loader</a></li></ul></div>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
              Copyright &#169;                    2011
                        <a href="http://sody.github.com/">sody</a>.
            All Rights Reserved.      
                
                  </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
